<%
var baseprofiles = {
    profiles: [

{
    id: "lakmal@wso2.com",
    firstname: "Lakmal",
    lastname: "Warusawithana",
    title: "Software Architect",
    organisation: "WSO2",
    bio: "<p>Lakmal joined WSO2 as a Software Architect and works with the Cloud Technology team, focusing on the WSO2 Stratos Platform-as-a- Service. (PaaS).</p><p>Lakmal has more than 11 years of industry experience. In 2005, Lakmal co-founded the thinkCube, the pioneers in developing the next generation of Collaborative Cloud Computing products that are tailored towards Telecom operators. He oversaw the overall engineering process and focussed special attention to scalability and service delivery of thinkCube solutions. </p>",
    expertise: "",
    registrationcode: "speaker",
    home: "Colombo, Sri Lanka",
    interests: "",
    accepting: 1
},
{
    id: "sharlene.jobson_jisc.com",
    firstname: "Sharlene",
    lastname: "Jobson",
    title: "Head of Nexus",
    organisation: "JISC Advance",
    bio: "<p>Sharlene has a wealth of experience in Programme, Operations and Business Management in both the Public and Private Sectors.</p><p>Her collaborative approach has underpinned Business and Operational Continuous Service Improvements through Change delivering benefits to Organisations.</p><p>She has successfully led major Technology and Systems Integration Business Improvement and Shared Services Programmes for Public Sector organisations such as Borders Agency, NHS, MoD and Education.</p><p>This experience extends to private companies such as AEAT and BT where Customer Service Excellence and Product improvement were critical to sustainability. </p>",
    expertise: "",
    registrationcode: "speaker",
    home: "London, UK",
    interests: "",
    accepting: 1
},
{
    id: "mifan_wso2.com",
    firstname: "Mifan",
    lastname: "Careem",
    title: "CTO",
    organisation: "Respere",
    bio: "<p>Mifan Careem is an ICT entrepreneur. He is Director/CTO at Respere, a company specializing in Humanitarian Solutions, and a Director of Sahana, the disaster management system project. He is also an Enterprise Architect, GIS consultant and a contributor to many Open Source projects. Mifan is the lead software architect of the national initiative to design and build a cloud based eGovernment solution for the local government bodies in Sri Lanka. Mifan is a neogeographer, and specializes in mobile computing, Enterprise Architecture, Business Intelligence, Disaster Management and GIS. </p>",
    expertise: "",
    registrationcode: "speaker",
    home: "Colombo, Sri Lanka",
    interests: "",
    accepting: 1
},
{
    id: "harshana_wso2.com",
    firstname: "Harshana",
    lastname: "Martin",
    title: "Senior Software Engineer",
    organisation: "WSO2",
    bio: "<p>Harshana joined WSO2 in September 2010. He is a software engineer and a member of the development technologies management committee who focuses on the WSO2 Developer Studio integrated development environment (IDE). Harshana also has contributed to several WSO2 QuickStart development consulting engagements.</p><p>Harshana participated in the Google Summer of Code program in both 2009 and 2010 with the Eclipse Foundation, and he is currently a committer for the Eclipse Communication Framework. Harshana also is an active contributor to the Apache Axis2 project.</p>",
    expertise: "",
    registrationcode: "speaker",
    home: "Colombo, Sri Lanka",
    interests: "",
    accepting: 1
},
{
    id: "samisa_wso2.com",
    firstname: "Samisa",
    lastname: "Abeysinghe",
    title: "VP Engineering",
    organisation: "WSO2",
    bio: "<p>Samisa Abeysinghe, WSO2 vice president of engineering, has more than a decade of experience working for systems integrators and software vendors with global exposure. In his current role, Samisa leads the development of WSO2’s three open source platforms: the WSO2 Carbon enterprise middleware platform, WSO2 Stratos cloud middleware platform, and WSO2 StratosLive PaaS.</p><p>Samisa has been a committer of the Apache Web services project since May 2004, and he initiated the Apache Axis2/C project. Samisa has published two books: RESTFul PHP Web Services, and PHP Team Development, in addition to several articles. He also has spoken at numerous industry conferences, including ApacheCon, ZendCon and IndicThreads, among others.</p><p>Samisa is a visiting lecturer at Computer Science and Engineering Department, University of Moratuwa, Sri Lanka. </p>",
    expertise: "",
    registrationcode: "speaker",
    home: "Colombo, Sri Lanka",
    interests: "",
    accepting: 1
},
        {
            id: "chamith_wso2.com",
            firstname: "Chamith",
            lastname: "Kumarage",
            title: "Associate Technical Lead",
            organisation: "WSO2",
            bio: "<p>Chamith joined WSO2 in November 2007 and is an Associate Technical Lead and Manager of Infrastructure.</p><p>He has over 5 years of experience in systems and network administration and currently oversees WSO2′s overall system and network operations. He was an original author of the Texplorer Project http://texplorer.sourceforge.net and is interested in platform and infrastructure virtualization, distributed computing, IT security, load balancing, cloud monitoring and backup systems.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "IVjWQMA1",
            firstname: "Adam",
            lastname: "Firestone",
            title: "Director of Defense and Government Solutions",
            organisation: "WSO2",
            bio: "<p>Adam Firestone joined WSO2 in 2012. He is the Director of Defense and Government Solutions where he works across the scope of the WSO2 team to understand, and craft technology solutions for, the unique challenges faced by military, intelligence and government organisations.</p><p>Adam works closely with developers, architects and C-Level executives to increase the footprint and value offered by open-source software in general and WSO2 products specifically to the military and defense communities. Adam also works with the WSO2 engineering team to ensure that WSO2‚Äôs product and technology roadmaps retain and develop features situated to support emerging defense and government requirements.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Washington DC, USA",
            interests: "",
            accepting: 1
        },
        {
            id: "51orUMAQ",
            firstname: "Afkham",
            lastname: "Azeez",
            title: "Director, Architecture",
            organisation: "WSO2",
            bio: "<p>Afkham Azeez joined WSO2 in December 2005, and he has served as director of architecture since 2011. In this role, he drives efforts focused on the development and enhancement of WSO2 middleware.</p></p>Azeez is an elected member of the Apache Software Foundation and also a Project Management Committee member and long-time committer for a number of projects. He specializes in distributed computing, highly available and scalable applications, Java 2 Platform Enterprise Edition (J2EE) technologies, and service-oriented architecture.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "AKfgEMAT",
            firstname: "Alberto",
            lastname: "Lagna",
            title: "CTO",
            organisation: "Biznology",
            bio: "<p>Alberto Lagna is Chief Technology Officer at Biznology srl, a SOA consulting company. He works as Software architect, Technical Leader and Mentor. He has 20 years of experience in the design and development of Enterprise Application based on JEE, XML and on the integration of complex systems (he started in C++ with CORBA and now in java applying the SOA approach). He teaches courses on the JEE platform and BPM(N). He promotes the the use of free software, supports the open source movement.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Italy",
            interests: "",
            accepting: 0
        },
        {
            id: "amilam@wso2.com",
            firstname: "Amila Maha",
            lastname: "Arachchi",
            title: "Technical Lead",
            organisation: "WSO2",
            bio: "<p>Amila Maha Arachchi joined WSO2 in September 2010 and currently works as a Technical Lead on the WSO2 Stratos project, where his area of focus involves metering, throttling and billing of WSO2 PaaS StratosLive.</p><p>Amila holds a B.Sc in Engineering from the Department of Computer Science and Engineering of the University of Moratuwa, Sri Lanka. Relatively new to the open source world, Amila has become very enthusiastic about it and loves contributing towards it.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "amila@wso2.com",
            firstname: "Amila",
            lastname: "Suriarachchi",
            title: "Software Architect",
            organisation: "WSO2",
            bio: "<p>Amila Suriarachchi joined WSO2 in January 2006. He is an architect and member of the data technologies management committee, who has focused on product management for the WSO2 Business Rules Server and WSO2 Complex Event Processing Server. Amila also has contributed to the development of the WSO2 Web Services Application Server. He specializes in cloud computing, data binding, and reliable messaging.</p><p>Amila is a member of the Apache Software Foundation, and has contributed to the Apache Axis2 and Sandesha2 projects. He is a Sun-certified Java programmer, a business component developer, and a certified Microsoft Visual C# .Net developer. He has published several WSO2 technical articles.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "6tEa8MAE",
            firstname: "Anand",
            lastname: "Krishnamurthy",
            title: "Practice Head",
            organisation: "Wipro Technologies",
            bio: "<p>Anand is the Practice Head, Wipro Technologies for Open Source Integration Practice and handling Solutions and Innovations for Enterprise Business Integration division. He has over 16 Years of IT Services and Consulting experience spanning across multiple e-Business technologies. Anand has also led multiple SOA and BPM strategic Initiatives for multiple customers across multiple domains. He possesses extensive knowledge of enterprise and solution architecture across e-Business Technologies and has helped customers (especially in the BFSI segment) create SOA/Integration roadmap and assist in implementing the roadmap through various SDLC models.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Bangalore, India",
            interests: "",
            accepting: 0
        },
        {
            id: "anjana@wso2.com",
            firstname: "Anjana",
            lastname: "Fernando",
            title: "Associate Technical Lead",
            organisation: "WSO2",
            bio: "<p>Anjana Fernando joined WSO2 in 2009. He is an associate technical lead and a member of the data technologies management committee, who focuses on development of the WSO2 Data Services Server. Anjana has conducted several onsite customer engagements, primarily focused on integration enabled by the WSO2 Enterprise Service Bus.</p><p>Anjana is a contributor to Apache Axix 2, and he participated in the Google Summer of Code 2006 where we worked on the Apache Mirae project in implementing a Multimedia Messaging Service (MMS) transport. He also brings experience in Mobile Computing, service-oriented architecture (SOA) for the European Union‚Äôs Information Society Technologies, and Java enterprise Web development.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "2dEjtMAE",
            firstname: "Asanka",
            lastname: "Abeysinghe",
            title: "Director, Solutions Architecture",
            organisation: "WSO2",
            bio: "<p>Asanka is WSO2 director of solutions architecture, and he focuses on the company‚Äôs vertical market capabilities, including financial services. Additionally, he provides consulting and conducts regular training sessions and workshops for enterprise IT architects and developers.</p><p>Asanka has more than 10 years industry experience implementing projects that range from desktop and Web applications through to highly scalable distributed systems and SOAs in the financial domain, mobile platforms, and business integration solutions.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Palo Alto, California, USA",
            interests: "",
            accepting: 1
        },
        {
            id: "brian",
            firstname: "Brian",
            lastname: "Behlendorf",
            title: "Senior Advisor for Science and Technology",
            organisation: "World Economic Forum",
            bio: "<p>Brian Behlendorf is a Senior Advisor for Science and Technology for the World Economic Forum. He recently completed a two year stint as their Geneva-based Chief Technology Officer, updating their internal systems and IT processes, and connecting their internal communities and initiatives to open technology concepts and leaders. Prior to that, in 2009 and 2010, he worked for the White House Office of Science and Technology Policy as an advisor on open data, open government, and open source software, focusing for much of that on the development of a platform for the exchange of electronic healthcare records. From 1999 to 2007 he founded and was CTO of CollabNet, the leader in enterprise software development and collaboration tools built upon Open Source software and principles. He continues to serve on CollabNet‚Äôs executive board of directors, and is on the executive boards of the Mozilla Foundation and Benetech. He also continues to help the Apache Software Foundation, a project he co-founded in 1995. Brian lives in San Francisco.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "San Francisco, California, USA",
            interests: "",
            accepting: 0
        },
        {
            id: "chamith@wso2.com",
            firstname: "Chamith",
            lastname: "Kumarage",
            title: "Associate Technical Lead",
            organisation: "WSO2",
            bio: "<p>Chamith joined WSO2 in November 2007 and is an Associate Technical Lead and Manager of Infrastructure.</p><p>He has over 5 years of experience in systems and network administration and currently oversees WSO2's overall system and network operations. He was an original author of the Texplorer Project http://texplorer.sourceforge.net and is interested in platform and infrastructure virtualization, distributed computing, IT security, load balancing, cloud monitoring and backup systems.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "charles.gibbons@jiscadvance.ac.uk",
            firstname: "Charles",
            lastname: "Gibbons",
            title: "Technical Design Authority",
            organisation: "JISC Advance",
            bio: "<p>Chief Architect for UK Higher and Further Education services delivering integration solutions. Expertise in commercial and not for profit SOA implementations.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "London, UK",
            interests: "",
            accepting: 0
        },
        {
            id: "chris@wso2.com",
            firstname: "Chris",
            lastname: "Haddad",
            title: "VP, Technology Evangelism",
            organisation: "WSO2",
            bio: "<p>Chris Haddad joined WSO2 as vice president of technology evangelism in 2011. In this role, Chris is raising visibility, awareness, and knowledge of the unique advantages provided by WSO2's lean, fully componentized, open source middleware for on-premise and the cloud.</p><p>Chris works closely with developers, architects, or C-level executives to increase WSO2 technology adoption, improve the middleware platform, and maximize customer value. He also works closely with WSO2's engineering team to define the product roadmaps for WSO2's Carbon and Stratos platforms.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Coco Beach, Florida, USA",
            interests: "",
            accepting: 1
        },
        {
            id: "damitha@wso2.com",
            firstname: "Damitha",
            lastname: "Kumarage",
            title: "Senior Technical Lead",
            organisation: "WSO2",
            bio: "<p>Damitha Kumarage joined WSO2 in August 2005. He is a Senior Technical Lead on the cloud technologies team, focusing on the WSO2 Stratos Live platform-as-a-service (PaaS). Previously, Damitha contributed to the development of the WSO2 Web Services Framework (WSF). He has also engaged in several WSO2 Quick Start consulting projects and larger-scale customer development support engagements.</p><p>Damitha has more than 11 years of industry experience. He is an elected member of the Apache Software Foundation and is an active contributor to the Apache Axis2/C project. He also has served as a team member on Phase 1 of the SAHANA open source disaster management system and Apache Axis C ++ projects.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "dipanjan@cognizant.com",
            firstname: "Dipanjan",
            lastname: "Sengupta",
            title: "Principle Architect",
            organisation: "Cognizant Technology Solutions",
            bio: "",
            expertise: "",
            registrationcode: "speaker",
            home: "Bangalore, India",
            interests: "",
            accepting: 0
        },
        {
            id: "dimuthu@wso2.com",
            firstname: "Dimuthu",
            lastname: "Leelarathne",
            title: "Software Architect",
            organisation: "WSO2",
            bio: "<p>Dimuthu joined WSO2 in December 2006. She an architect and co-chair of the platform technologies management committee, who focuses on cloud technologies, the WSO2 Carbon Framework, and WSO2 Identity Server.</p><p>Dimuthu is an expert in Java and Java-related technologies. She was an initial team member of the Axis-Mora project which served as proof of concept for Apache Axis2. where she overlooked the de-serialization process in this project. Dimuthu is an Apache committer and a member of the Axis2 Project Management Committee. In addition to Apache Axis2, she also has contributed to the Apache Rampart and WSS4J projects.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "djusto@bip.b.br",
            firstname: "Diogenes",
            lastname: "Justo",
            title: "IT Manager",
            organisation: "Banco Indusval & Partners",
            bio: "<p>With over 16 years of industry experience, Diogenes is an IT Systems and Project Manager for the Banco Indusval & Partners, a Brazilian bank focused in middle and corporate segments. He holds an MSc in economics and is a qualified project manager with PMP credentials. An expert mathematician, Diogenes wrote his first algorithm when he was 9 just for fun!</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Brazil",
            interests: "",
            accepting: 0
        },
        {
            id: "srinath@wso2.com",
            firstname: "Srinath",
            lastname: "Perera",
            title: "Senior Software Architect",
            organisation: "WSO2",
            bio: "<p>Dr. Srinath Perera joined WSO2 in June 2009. He is a senior software architect who overlooks the overall WSO2 platform architecture alongside WSO2 CTO Paul Fremantle. He specializes in Web services and distributed systems, specifically working with aspects of data, scale and performance.</p><p>Srinath is a co-founder of Apache Axis2, an elected member of the Apache Software Foundation, and a Project Management Committee (PMC) member. He has been involved with the Apache Web Services project since 2002, and he is a committer on several Apache open-source projects, including Apache Axis, Axis2, and Geronimo.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "eben@pi.com",
            firstname: "Eben",
            lastname: "Upton",
            title: "Founder and Trustee",
            organisation: "Raspberry Pi Foundation",
            bio: "<p>Eben Upton is the founder and trustee of Raspberry Pi Foundation, a non-profit supported by the University of Cambridge Computer Laboratory and Broadcom. The Foundation‚Äôs aim is to promote the study of computer science and related topics. Mr. Upton is responsible for the software and hardware architecture of the Raspberry Pi, a single-board computer designed to stimulate the teaching of basic computer science in schools. He also is a technical director and ASIC architect at Broadcom, and he previously was a director of studies in computer science at St. John‚Äôs College, Cambridge.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Spain",
            interests: "",
            accepting: 0
        },
        {
            id: "CGenYMAT",
            firstname: "Elena",
            lastname: "√Ålvarez",
            title: "Head of the Morphology and Syntax Department",
            organisation: "Molino de Ideas",
            bio: "<p>Elena is passionate about languages and works at Molino de Ideas, a Natural Language Processing company settled in Spain developing linguistic tools that treat texts automatically, like morphological analyzers, stemmers, language detectors, etc. Obviously, all these inventions can be accesed via API.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Spain",
            interests: "",
            accepting: 0
        },
        {
            id: "2dDlGMAU",
            firstname: "Fabiola",
            lastname: "Pereira",
            title: "System Analyst",
            organisation: "Algar Telecom",
            bio: "<p>Fabiola Pereira is System Analyst at Algar Telecom since 2011. Experience on architecting and building scalable distributed computing systems, in the areas of Java and Databases. Master in Computer Science in database area by Federal University of Uberlandia, with BSc in Computer Science also at Federal University of Uberl√É¬¢ndia. Fabiola published articles about adding user preferences in SQL queries and implementing a preference language at PostgreSQL.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Brazil",
            interests: "",
            accepting: 0
        },
        {
            id: "harshana@wso2.com",
            firstname: "Harshana",
            lastname: "Martin",
            title: "Senior Software Engineer",
            organisation: "WSO2",
            bio: "<p>Harshana joined WSO2 in September 2010. He is a software engineer and a member of the development technologies management committee who focuses on the WSO2 Developer Studio integrated development environment (IDE). Harshana also has contributed to several WSO2 QuickStart development consulting engagements.</p><p>Harshana participated in the Google Summer of Code program in both 2009 and 2010 with the Eclipse Foundation, and he is currently a committer for the Eclipse Communication Framework. Harshana also is an active contributor to the Apache Axis2 project.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "hasini@wso2.com",
            firstname: "Hasini",
            lastname: "Gunasinghe",
            title: "Senior Software Engineer",
            organisation: "WSO2",
            bio: "<p>Hasini Gunasinghe joined WSO2 in September 2010. She is a software engineer on the integration technologies team, focusing on identity management and security aspects of the WSO2 Identity Server.</p><p>Hasini specializes in distributed computing, cloud computing and computer security. During an internship, she carried out research and development for a session initiation protocol (SIP)-based soft phone project. At the Microsoft Imagine Cup 2008, Hasini placed second runner up in the software design category.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "igor.berchtold@suva.ch",
            firstname: "Igor",
            lastname: "Berchtold",
            title: "Senior IT Architect",
            organisation: "Suva",
            bio: "<p>Igor Berchtold joined Suva as Senior Software Architect in 2001. He was first responsible to build up a development infrastructure and application framework based on JEE. Since 2008 he is Technical Lead & Product Manager for the Suva Integration Platform. He brings to his role more than 18 years of technology and management experience in application development, middleware and service-oriented architecture (SOA).</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Czech Republic",
            interests: "",
            accepting: 0
        },
        {
            id: "isabelle@wso2.com",
            firstname: "Isabelle",
            lastname: "Mauny",
            title: "Director, Product Management",
            organisation: "WSO2",
            bio: "<p>Isabelle Mauny joined WSO2 as director of product management in 2012. She brings to her role more than 18 years of technology, consulting and management experience in Java, application development, middleware, and service-oriented architecture (SOA).</p><p>Prior to WSO2, Isabelle was responsible for product management and training at Vordel, a leading SOA gateway provider. She also helped to design and review architectures for many of Vordel‚Äôs strategic accounts across the government, banking, insurance and telecommunications sectors, particularly in Europe and Latin America.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Madrid, Spain",
            interests: "",
            accepting: 1
        },
        {
            id: "kasun@wso2.com",
            firstname: "Kasun",
            lastname: "Indrasiri",
            title: "Associate Technical Lead",
            organisation: "WSO2",
            bio: "<p>Kasun Indrasiri joined WSO2 in December 2009. He is an associate technical lead and member of the integration technologies management committee, who focuses on the WSO2 Enterprise Service Bus (ESB). In addition to his product development efforts, Kasun has provided technology consulting on customer engagements, helping to successfully implement solutions for integrating Web services, SAP, FIX, and mobile services.</p><p>Kasun is an elected member of the Apache Software Foundation and a Project Management Committee member and committer for the Apache Synapse open source ESB project. He took part in the Google Summer of Code for 2007, working on the Apache Axis2/C project. He also contributed to the Apache Rampart/C project, having implemented WS-Trust specification for its federated identity framework for Web services. Kasun is proficient in C/C++, specializing in Web services, information retrieval systems, and enterprise search platforms, focusing primarily on indexing components.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "mifan@wso2.com",
            firstname: "Mifan",
            lastname: "Careem",
            title: "CTO",
            organisation: "Respere",
            bio: "<p>Mifan Careem is an ICT entrepreneur. He is Director/CTO at Respere, a company specializing in Humanitarian Solutions, and a Director of Sahana, the disaster management system project. He is also an Enterprise Architect, GIS consultant and a contributor to many Open Source projects. Mifan is the lead software architect of the national initiative to design and build a cloud based eGovernment solution for the local government bodies in Sri Lanka. Mifan is a neogeographer, and specializes in mobile computing, Enterprise Architecture, Business Intelligence, Disaster Management and GIS.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "2e9LMMAY",
            firstname: "Miyuru",
            lastname: "Wanninayaka",
            title: "Senior Software Engineer",
            organisation: "WSO2",
            bio: "<p>Miyuru Wanninayaka joined WSO2 in August 2009. He is a senior software engineer and member of the integration technologies management committee, who focuses on the WSO2 Enterprise Service Bus (ESB). In addition to his product development efforts, Miyuru has provided technology consulting on customer engagements, helping to successfully implement enterprise integration and mobile services gateway solutions.</p><p>Miyuru is a Sun-certified Java programmer and committer for the Apache Synapse open source ESB project. As a participant in the Google Summer of Code for 2008, Miyuru developed a data mining and visualization library for Sahana, an open source disaster management system.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "nandika@wso2.com",
            firstname: "Nandika",
            lastname: "Jayawardana",
            title: "Senior Technical Lead",
            organisation: "WSO2",
            bio: "<p>Nandika joined WSO2 in August 2005. He is a senior technical lead and a member of the integration technologies management committee.</p><p>Nandika has contributed to the development of the WSO2 Business Process Server and WSO2 Web Services Frameworks for PHP, C, and CPP. Additionally, he has provided technology consulting on customer integration projects using the WSO2 Enterprise Service Bus and WSO2 Business Process Server.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "FbagaMAB",
            firstname: "Nuwan",
            lastname: "Bandara",
            title: "Associate Technical Lead",
            organisation: "WSO2",
            bio: "<p>Nuwan Bandara joined WSO2 in July 2009. He is a associate technical lead and member of the development technologies management committee, focusing on the WSO2 Gadget Server, WSO2 Mashup Server, Jaggery, and API Store. Additionally, Nuwan has provided technology consulting on customer engagements, including identity solutions and systems integration for the telecommunications, banking and financial services industries.</p><p>Nuwan specializes in Java enterprise technologies, service-oriented architecture (SOA) implementation, distributed computing, Web engineering with Java/PHP technologies and software design patterns. He has contributed to the Apache Web Services and Shindig projects. In 2007 and 2008, Nuwan conducted research and development for the European Union‚Äôs (EU) Information Society Technologies SOA and mobile computing projects. He also is a member of the British Computer Society.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "pankaj",
            firstname: "Pankaj",
            lastname: "Srivastava",
            title: "Vice President Engineering",
            organisation: "Cisco Systems",
            bio: "<p>Pankaj Srivastava brings more than 20 years of Systems Integration, Solutions and Software Engineering, and Enterprise Architecture experience. Over the last 10 years, he has played the role of Technical / Business leader of innovative Software Engineering Groups and Solutions Technology Groups. Over the years he has also developed in-depth technical expertise in the areas of Application Infrastructure, SOA, Middleware and Enterprise Applications, Video-based applications, and Cloud Applications.</p><p>At Cisco over the past 8 years, he has led several innovative solution development and delivery initiatives, creating solutions and businesses around those new solutions. As leader of Industry Solutions Group‚Äôs Software Factory, Pankaj has led the creation, development, management, business planning and delivery of a succession of software-enabled, integrated hardware/software solutions: RFID and Supply Chain, joint Cisco-SAP in Governance Risk and Compliance, Financial Trades Monitoring, Application Visibility and Monitoring, the Video-based Fan experience solution for Sports & Entertainment, Video/Kiosk solutions for Transportation and subway systems, Lecture Streaming/Capture solutions for Higher Education customers and Cloud based application solutions/platforms for Education and Healthcare industries. These solutions are all based on network-embedded software platforms that Pankaj has created platforms that enable HTML5-based application experience, complex-event processing and application infrastructure capabilities in the network.</p><p>For these solutions he has also led lighthouse implementations of the solutions at key customers in several industries Sports, Logistics, Transportation, Public Sector, Manufacturing, Financial Services, Healthcare, Education and Telecommunications Service Providers. In addition, Pankaj plays a lead role as Enterprise Architect in engaging key customers for business transformation, using software-enabled solutions and cloud-based applications.</p><p>Pankaj Srivastava has a Computer Science B.Sc. from M.I.T with a minor in Economics.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Milpitas, California, USA",
            interests: "",
            accepting: 0
        },
        {
            id: "2d8xuMAA",
            firstname: "Paul",
            lastname: "Fremantle",
            title: "Co-founder & CTO",
            organisation: "WSO2",
            bio: "<p>Paul Fremantle, CTO, co-founded WSO2 in 2005 in order to reinvent the way enterprise middleware is developed, sold, delivered and supported through an open source model. In his current role as CTO, Paul spearheads WSO2's overall product strategy. Previously, he served as WSO2 vice president of technical sales where he led the development of the groundbreaking WSO2 Enterprise Service Bus. In 2008, Paul was recognized as by InfoWorld as a Top 25 CTO.</p><p>Prior to WSO2, Paul was a senior technical staff member at IBM for nine years. There, Paul created the Web Services Gateway and led the team that developed and shipped it as part of the WebSphere Application Server. He also was on the team that put the Service Integration Bus technology into WebSphere Application Server 6. Additionally, Paul was the key WebSphere technical sales lead for Europe, working closely with development to manage beta programs, develop training materials, and enable first-of-a-kind J2EE projects.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Portsmouth, UK",
            interests: "",
            accepting: 1
        },
        {
            id: "phiroze@stubhub.com",
            firstname: "Phiroze",
            lastname: "Dastoor",
            title: "Senior Application Architect",
            organisation: "Stubhub.com",
            bio: "<p>Phiroze Dastoor is a Senior Application Architect on the Buyer Experience Stream, at StubHub.</p><p>Phiroze has extensive experience with distributed enterprise systems and services-based architectures in various companies such as FedEx, Sabre/Travelocity, Lockheed-Martin and most recently Walmart Global Ecommerce.</p><p>At StubHub, Phiroze works on the architecture and design of critical customer-facing systems, including those for recommendations / personalization and business services. He also contributes extensively to StubHub‚Äôs on-going re-architecture effort and domain-based SOA. The services-based infrastructure being designed at StubHub incorporates WSO2's API Gateway as one of its pivotal technologies, to help manage the external and internal services.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "San Jose, California, USA",
            interests: "",
            accepting: 0
        },
        {
            id: "2dAxTMAU",
            firstname: "Prabath",
            lastname: "Siriwardena",
            title: "Senior Architect",
            organisation: "WSO2",
            bio: "<p>Prabath Siriwardena joined WSO2 in November 2007. He is an architect and chair of the integration technologies management committee, focusing on application security and identity management. In addition to his product development efforts, Prabath has provided technology consulting on customer engagements, working on the integration of OpenID support.</p><p>Prabath is an Apache Project Management Committee member involved in the Apache Rampart and Axis projects. He also has more than three years industry experience in Microsoft .NET technologies. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "2eAdCMAU",
            firstname: "Pradeep",
            lastname: "Fernando",
            title: "Senior Software Engineer",
            organisation: "WSO2",
            bio: "<p>Pradeep joined WSO2 in the year 2010. He is a senior software engineer and a member of the platform technologies management committee focusing on WSO2 Carbon. In addition to his development efforts, Pradeep also has provided technology consulting on customer engagements, including customer QuickStart programs. Previously, he was a WSO2 intern in 2008.</p></p>Pradeep has contributed to the Apache Axis2 project of the Apache Software Foundation. He also has published several technical articles based on his final-year university project, Empowering Web-Gadget Communication with Tuple Space. The project focused on developing a scalable and distributed tuple space implementation. Additionally, he has conducted a tutorial session on Introduction to OSGi and Carbon at the WSO2Con 2011 user conference.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "6tEa8MAE",
            firstname: "Prajod",
            lastname: "Vettiyattil",
            title: "Lead Architect",
            organisation: "Wipro Technologies",
            bio: "<p>Architect in the open source integration group, at Wipro Technologies. Have lead many projects in JEE and SOA areas. Other experience includes: consulting with customers on open source adoption, product selection, and project implementation; design and implementation of open source based solutions; evangelizing the value of open source to one and all.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Bangalore, India",
            interests: "",
            accepting: 0
        },
        {
            id: "etwaru@ubs.com",
            firstname: "Richie",
            lastname: "Etwaru",
            title: "Director, Group Technology",
            organisation: "UBS",
            bio: "<p>Richie operates a portfolio of projects in transformation, applied innovation, and other emerging technologies at UBS, he is an accomplished program and area manager with experience assembling and leading multidisciplinary teams. He has earned a reputation as a strategic thinker and solutions architect with a record of leading the design of solutions that are commercially viable and generate competitive advantage. Mr. Etwaru has a 16+ year track record as a transformational leader chartering efficiency, championing centers of excellence, defining new intellectual property, writing and speaking, and having fun at large organizations as well as startups. He is a former CIO, former Head of Innovation, winner of the Notre Dame Business Plan Writing competition in 2002, winner of Small Business awards in 2003, and has been involved in several stat-ups. He holds two international patents, has spoken at several events across the US and is currently completing is Doctoral studies in Management and Organizational Leadership.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 0
        },
        {
            id: "B5G3qMAF",
            firstname: "Roger",
            lastname: "Carhuatocto",
            title: "IT Consultant",
            organisation: "Konosys",
            bio: "<p>Roger CARHUATOCTO and Mikel ASLA have over 12 years of experience as IT Consultants and Critical System Architects. Roger and Mikel blends his experience in Computer Security and Identity Management with his passion for Free and Open Source technology. Roger and Mikel, now part of a business initiative called KONOSYS where combines and integrates technologies such as e-DNI, IdM, SSO, Liferay Portal, Alfresco ECM, BPM and SOA technologies in several Projects in Spain.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Spain",
            interests: "",
            accepting: 0
        },
        {
            id: "2e9BgMAI",
            firstname: "Sameera",
            lastname: "Jayasoma",
            title: "Senior Technical Lead",
            organisation: "Konosys",
            bio: "<p>Sameera Jayasoma joined WSO2 in May 2008. He is a technical lead and a member of the platform technologies management committee, focusing on the WSO2 Carbon and WSO2 Web Services Application Server. As a WSO2 intern in 2007, Sameera developed an Axiom version of Rhino‚Äôs E4X implementation, which is used in the WSO2 Mashup Server. He also has provided technology consulting on customer engagements, including Quick Start Program, Business Process Execution Language (BPEL), and cloud projects.</p><p>Sameera has contributed to a number of Apache Software Foundation (ASF) projects, including Apache Axis2 and Axiom. He also was a co-developer of Apache Rampart2. During the 2007 Google Summer of Code, Sameera also contributed to the development of JAX-WS templates for the Apache Axis2/Java Codegen tool.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "sanjeewa@wso2.com",
            firstname: "Sanjeewa",
            lastname: "Malalgoda",
            title: "Software Engineer",
            organisation: "WSO2",
            bio: "<p>Sanjeewa joined WSO2 in September 2010. He is a software engineer, focusing on WSO2 Elastic Load Balancer and WSO2 Stratos. Sanjeewa is a member of the platform technologies team where he implemented the tenant aware load balancer and specializes in usage data metering and throttling in cloud environments.Sanjeewa also has provided technology consulting on customer engagements, including customer QuickStart programs.</p><p>In addition to his product development efforts Sanjeewa is a member of the Blackberry Developers Community, associate member of the Institute of Engineers, Sri Lanka and a member of the International Association of Computer Science and Information Technology. He is also a Cisco Certified Network Associate (CCNA).</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "sanjiva@wso2.com",
            firstname: "Sanjiva",
            lastname: "Weerawarana",
            title: "Founder and CEO",
            organisation: "WSO2",
            bio: "<p>Dr. Sanjiva Weerawarana, chairman and CEO, founded WSO2 in 2005 in order to reinvent the way enterprise middleware is developed, sold, delivered and supported through an open source model. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "senaka@wso2.com",
            firstname: "Senaka",
            lastname: "Fernando",
            title: "Technical Lead",
            organisation: "WSO2",
            bio: "<p>Senaka Fernando joined WSO2 in April 2009. He is an associate technical lead and a member of the integration technologies management committee, who has focused on the WSO2 Governance Registry and WSO2 Cloud Services Gateway. In addition to his product development efforts, Senaka has provided technology consulting on customer engagements, helping to successfully implement governance, enterprise application integration, SAP integration, and on-premise portal solutions. Senaka also founded the WSO2 Web Services Framework/C++ during his internship with WSO2 in 2008.</p><p>Senaka is an elected member of the Apache Software Foundation (ASF) and also a Project Management Committee (PMC) member and committer for a number of projects, which currently include Apache Web Services, Axis2, and several Apache incubator projects. Additionally, Senaka is a member of the OASIS S-RAMP, WEMI, and TOSCA technical committees. As a participant in the Google Summer of Code for both 2008 and 2009, he also worked on the Apache Harmony and Ptolemy II projects at the University of California, Berkeley.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "FcspGMAR",
            firstname: "Stephen",
            lastname: "Oostenbrink",
            title: "Enterprise Architect",
            organisation: "Yenlo BV/Dutch Ministry of Infrastructure and the Environment",
            bio: "<p>Stephen Oostenbrink works as enterprise architect for the Ministry of Infrastructure and Environment (IenM) in the Netherlands. He is responsible for the service oriented architecture, integration and API strategy. Stephen advises policy makers how to incorporate information technology in legislation to simplify and optimize the execution. With relentless energy and drive to make a change, he raises awareness and drives adoption of service oriented architecture and new technologies.</p><p>Previously Stephen worked for Accenture where he worked mainly in the retail, aviation, automotive and utilities markets, advising clients in the area of strategy, business and IT alignment and architecture.</p><p>Stephen is a member of the Dutch government interoperability board which advises the Dutch government on interoperability standards. He enjoys inspiring others and sharing his experience by speaking on the subjects of enterprise architecture and service oriented architecture.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "The Netherlands",
            interests: "",
            accepting: 0
        },
        {
            id: "sumedha@wso2.com",
            firstname: "Sumedha",
            lastname: "Rubasinghe",
            title: "Software Architect",
            organisation: "WSO2",
            bio: "<p>Sumedha Rubasinghe joined the WSO2 in November 2006. He is a software architect and chair of the data technologies management committee, who focuses on development of the WSO2 Carbon Core, WSO2 Data Services, WSO2 Governance Registry, WSO2 Business Activity Monitor, and WSO2 API Manager. Sumedha has contributed to the successful implementation of data, SAP and repository-based integration projects, as well many WSO2 QuickStart development consulting engagements. Sumedha is an active committer with the Apache Axis2 project.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "tharindu@wso2.com",
            firstname: "Tharindu",
            lastname: "Mathew",
            title: "Associate Technical Lead",
            organisation: "WSO2",
            bio: "<p>Tharindu Matthew joined WSO2 in 2009. He is a senior software engineer and a member of the data technologies management committee, focusing on big data, analytics, and business activity monitoring (BAM). In addition to developing WSO2 middleware, Tharindu has provided technology consulting on customer engagements spanning the United States, Europe and Asia, and covering implementations of the WSO2 Governance Registry, WSO2 BAM, WSO2 Application Server, WSO2 Business Rules Server, WSO2 Complex Event Processing Server, and WSO2 Business Process Server.</p><p>Tharindu founded the WSO2 Web Services Framework/Spring during his internship with WSO2 in 2008. He also contributed to implementing Hessian Support for the WSO2 Enterprise Service Bus. He also took part in the Google Summer of Code for 2008 working on Apache Harmony, an open source Java implementation. Tharindu also has contributed to Apache Cassandra, Hadoop, Thrift and Axis2.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "CjLsRMAV",
            firstname: "Thijs",
            lastname: "Volders",
            title: "Senior Software Architect",
            organisation: "Yenlo BV",
            bio: "<p>Thijs Volders is a Senior Software Architect at Yenlo. He brings to his role more than 15 years of technology and consulting experience in Java, application development, middleware, and service-oriented architecture (SOA). He is the youngest member of the Java Magazine Advisory Board. He has written numerous articles e.g. comparison of build management tools and co-written several whitepapers and speaker at conferences. He recently built the ebMS adapter for the WSO2 ESB.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "The Netherlands",
            interests: "",
            accepting: 1
        },
        {
            id: "yefim@gartner.com",
            firstname: "Yefim",
            lastname: "Natis",
            title: "Vice President and Gartner Distinguished Analyst",
            organisation: "Gartner Research",
            bio: "<p>Yefim Natis is a Vice President and Gartner Distinguished Analyst in Gartner Research. Mr. Natis‚Äô research focuses on application software infrastructure, including technologies such as platforms as a service (PaaS) and application servers. His interests include application integration, open computing, context-aware computing and in-memory computing. Mr. Natis also researches the fundamental software architectures, including event-driven architecture, service-oriented architecture and next-generation application architectures, as well as .NET and Java EE.</p><p>Prior to joining Gartner, Mr. Natis worked at Magna Software, a software start-up where he was the director of software architecture and the principal architect of MAGNA X, a generator of service-oriented transaction processing applications. Mr. Natis‚Äô experience also includes IT architecture and IT management positions at Hogan Systems and Citigroup. He has 30 years of experience in enterprise IT. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "USA",
            interests: "",
            accepting: 0
        },
        {
            id: "2d8xQMAQ",
            firstname: "Selvaratnam",
            lastname: "Uthaiyashankar",
            title: "Director, Cloud Solutions",
            organisation: "WSO2",
            bio: "<p>Selvaratnam Uthaiyashankar joined WSO2 in September 2007. He is a senior software architect and chair of the cloud technologies management committee. Shankar focuses on the WSO2 Stratos cloud middleware platform and Carbon enterprise middleware kernel, and he has worked on the interoperability of Axis2/C and the WSO2 Web Services Framework (WSF). Additionally, Shankar has provided technology consulting on customer engagements, including cloud, enterprise service bus (ESB), governance, and mobile integration solutions.</p><p>Shankar is an Apache Software Foundation member and committer on the Axis2/C, Axis2, Rampart/C, and Rampart projects. With more than four years of industry experience, he has a strong background in telecommunication software development and after-sale support. Additionally, he is proficient in C++, Oracle and COM+ technologies.</p>",
            expertise: "",
            registrationcode: "",
            home: "Colombo, Sri Lanka",
            interests: "",
            accepting: 1
        },
        {
            id: "1HYF0MAO",
            firstname: "Jonathan",
            lastname: "Marsh",
            title: "Vice President Business Development",
            organisation: "WSO2",
            bio: "<p>Jonathan handles partnerships, alliances, new business initiatives for WSO2.</p>",
            expertise: "",
            registrationcode: "",
            home: "Auburn, CA, USA",
            interests: "partnerships, alliances, strategic oem agreements",
            accepting: 1
        },
        {
            id: "devaka@wso2.com",
            firstname: "Devaka",
            lastname: "Randeneya",
            title: "Vice President Global Sales",
            organisation: "WSO2",
            bio: "<p>Devaka oversees global sales operations for WSO2.</p>",
            expertise: "",
            registrationcode: "",
            home: "Palo Alto, CA, USE",
            interests: "sales, customers, support",
            accepting: 1
        }
    ]
}
%>