var baseagenda = {
    sessions: [
        {
            id: "reg1",
            type: "break",
            title: "Registration",
            speaker: [],
            abstract: "",
            start: new Date(2013,9,29,08,30),
            end: new Date(2013,9,29,09,00),
            location: "none",
	    track:0
        },
        {
            id: "t1t01a",
            type: "tutorial",
            title: "Rapidly Building Enterprise Apps, APIs, and Services with WSO2 Developer Studio",
            speaker: ["harshana@wso2.com", "sameera@wso2.com"],
            abstract: "<p>With the introduction of SOA, enterprise application developers are faced with several challenges; they need to implement a componentized service model and, as a result, make certain technical decisions such as whether to use SOAP-based services or RESTful implementations. At the implementation stage, a number of different SOAs may have to be considered to meet specific requirements. This would mean that developers will have to use different tools and spend time learning and adapting them to implement the complete system.</p><p>So, what if there was a single tooling platform that supports the implementation of the different types of SOAs that will run on your favorite Java IDE? Our solution is WSO2 Developer Studio IDE, which offers all SOA tools to build your enterprise applications under one hood running on top of the most popular Java IDE, Eclipse. WSO2 Developer Studio consists of tools to support the entire WSO2 Carbon Platform, which includes tooling support for Data Services, ESB Mediation flows, BPEL-based Business Processes, Web-Application and Jaggery Application for the front-end and much more. Most of these tools also come with a user-friendly graphical editor that allows you to drag and drop different components into editor and connect them with your pointing device.</p>           <p>This tutorial will illustrate the basic functions and features supported by WSO2 Developer Studio and demonstrate how developers can use it in real-world enterprise application development scenarios. You will also learn how WSO2 Developer Studio can be used to deploy the application to the WSO2 Carbon enterprise middleware platform and how to manage enterprise application components with source control systems as well as build tools among others.</p>",
            start: new Date(2013,9,29,09,00),
            end: new Date(2013,9,29,12,30),
            location: "TT1",
	    track:1
        },
        {
            id: "t2t01a",
            type: "tutorial",
            title: "Advancing Integration Competency and Excellence with the WSO2 Integration Platform",
            speaker: ["miyuru@wso2.com", "kasun@wso2.com"],
            abstract: "<p>Successful business requires the integration of heterogeneous systems that include internal systems, external services, and cloud APIs. WSO2 ESB is a robust, high performance and feature-rich integration platform that will cater to all your integration needs.</p><p>In this tutorial, Kasun and Miyuru will discuss implementing the real-world integration solution with WSO2 ESB, and will focus mainly on</p><ul style=\"margin:0px 0px 0px 30px;\"><li>Brandnew WSO2 ESB Cloud Connectors</li><li>New RESTful Integration capabilities</li><li>Store and Forward and advanced integration patterns</li></ul>",
            start: new Date(2013,9,29,09,00),
            end: new Date(2013,9,29,12,30),
            location: "TT1",
	    track:2
        },
        {
            id: "t3t01a",
            type: "tutorial",
            title: "Javascript Everywhere: Backend to Web and Mobile Apps in Javascript",
            speaker: ["nuwan@wso2.com", "srinath@wso2.com"],
            abstract: "<p>Web teams often choose development practices that embrace simplicity, widespread reach, and fast-iterative scripting. While teams can choose from many scripting languages, only JavaScript natively reaches into web browsers and unifies web application development across mobile devices, PC clients, media devices, and servers. When web developers use a single scripting language to build server-side data access, compose APIs, send messages, and build a client-driven user experience, teams can simplify roles, accelerate development timelines, and increase agility.</p><p>This will be a hands-on session, where Nuwan and Samisa will discusses and elaborate on the development of full-stack JavaScript.</p>",
            start: new Date(2013,9,29,09,00),
            end: new Date(2013,9,29,12,30),
            location: "TT1",
	    track:3
        },
        {
            id: "t4t01a",
            type: "tutorial",
            title: "How to make Enterprise SOA & IT Governance a Success",
            speaker: ["senaka@wso2.com", "chris@wso2.com"],
            abstract: "",
            start: new Date(2013,9,29,09,00),
            end: new Date(2013,9,29,12,30),
            location: "TT1",
	    track:4
        },
        {
            id: "t5t01a",
            type: "tutorial",
            title: "WSO2 App Factory - Increasing IT Responsiveness and Agility with Enterprise Private PaaS",
            speaker: ["azeez@wso2.com", "shankar@wso2.com"],
            abstract: "<p>Rapid growth in the number of applications developed today demands an enterprise to have a complete PaaS, which helps in managed application development and delivery process. The challenge lies in the fact that when you get an idea for an application, how soon can you get the infrastructure and tools needed for you to develop and deploy applications?</p><p>WSO2 App Factory revolutionizes the application delivery process by providing a platform for managed application development for the entire lifecycle of application, starting from cradle to grave. It integrates with various existing SDLC tools, such as source control, build management, bug tracking, code quality, and deployment, so that you can use your tools of choice in each lifecycle stage to manage your application.</p><p>In this tutorial session, Azeez and Shankar will cover the following topics with live examples (please bring your laptop for the session):</p><ul style=\"margin:0px 0px 0px 30px;\"><li>WSO2 App Factory introduction and features</li><li>Developing an application using WSO2 App Factory</li><li>Application lifecycle management using WSO2 App Factory</li><li>Overview of SDLC tools integrated with WSO2 App Factory</li></ul>",
            start: new Date(2013,9,29,09,00),
            end: new Date(2013,9,29,12,30),
            location: "TT1",
	    track:5
        },
        {
            id: "t6t01a",
            type: "tutorial",
            title: "API Management Jumpstart: Five Actions to Take",
            speaker: ["sumedha@wso2.com", "isabelle@wso2.com"],
            abstract: "<p>In this tutorial, we describe the 5 steps to jumpstart an API Management deployment within your company. Each step is illustrated by a presentation, a hands-on lab and discussion.</p><p>This session is recommended for all customers who have already started putting in place an API Management solution or are intending to do so. We will give plenty of time for discussion and exchange between Sumedha and Isabelle and fellow attendees. The tutorial will cover the following action points:</p><p>Design and Development</p><ul style=\"margin:0px 0px 0px 30px;\"><li>Define your API</li><li>Understand the audience</li><li>Come up with an intuitive interface</li><li>Implement</li></ul><p>Publish</p><ul style=\"margin:0px 0px 0px 30px;\"><li>Define external interfaces</li><li>Create documentation, samples, SDKs</li><li>Publish API to Store, advertise it</li></ul><p>Test</p><ul style=\"margin:0px 0px 0px 30px;\"><li>Test for functional accuracy, load</li><li>Demonstrate using a sample application</li></ul><p>Monitor</p><ul style=\"margin:0px 0px 0px 30px;\"><li>Collect statistics and analyze</li><li>Graph them for easy visualization</li><li>Understand trends and respond</li></ul><p>Extend</p><ul style=\"margin:0px 0px 0px 30px;\"><li>Adding additional mediation extensions</li><li>Customizations</li></ul><p>We will distribute a virtual machine to execute the labs. Please bring your laptop to this session.</p>",
            start: new Date(2013,9,29,09,00),
            end: new Date(2013,9,29,12,30),
            location: "TT1",
	    track:6
        },
        {
            id: "lunch1",
            type: "break",
            title: "Lunch",
            speaker: [],
            abstract: "",
            start: new Date(2013,9,29,12,30),
            end: new Date(2013,9,29,13,30),
            location: "none",
	    track:0
        },
        {
            id: "t1t02a",
            type: "tutorial",
            title: "Turning Events and Big Data into Insight with WSO2 CEP and WSO2 BAM",
            speaker: ["suho@wso2.com", "anjana@wso2.com"],
            abstract: "<p>Enterprise systems such as enterprise resources planning (EPR), system monitoring, and stock transaction and financial transaction systems generate an enormous amount of events that can contain useful data; processing these data efficiently can help to gain a competitive advantage. Implementing custom solutions to capture, analyze, and act on these Big Data imposes challenges and operational complexities. WSO2 CEP and WSO2 BAM together provide a solution to deliver a low-latency, high-volume, and scalable environment enabling data collection, real-time as well as batch analysis and firing notifications of multiple types across numerous endpoints.</p><p>This will be a hands-on session, where Suho and Anjana will discuss and elaborate on the full WSO2 Big Data stack.</p>",
            start: new Date(2013,9,29,13,30),
            end: new Date(2013,9,29,17,00),
            location: "TT1",
	    track:1
        },
        {
            id: "t2t02a",
            type: "tutorial",
            title: "Reducing the Operations Burden and Increasing QoS:  WSO2 Platform Management and Administration Tactics",
            speaker: ["charitha@wso2.com","chamith@wso2.com"],
            abstract: "<p>To achieve real benefits of your WSO2 on-premise or cloud deployments, it is crucial that you are equipped with proper tools and tactics for managing and administrating WSO2 products.</p><p>When your production system grows with multiple nodes and heterogeneous platform integrations, planning and managing the deployment proactively becomes essential.</p><p>It is also important to address the issues as fast as possible by identifying the root causes to recover the mission-critical business operations following an incident.</p><p>In this tutorial, Charitha and Chamith will describe what you need to know about the deployment, administration, and management of the WSO2 SOA middleware platform. The session will include</p><ul style=\"margin:0px 0px 0px 30px;\"><li>Deployment automation</li><li>Clustering</li> <li>Server monitoring</li><li>Troubleshooting tips</li><li>Performance tuning</li></ul>",
            start: new Date(2013,9,29,13,30),
            end: new Date(2013,9,29,17,00),
            location: "TT1",
	    track:2
        },
        {
            id: "t3t02a",
            type: "tutorial",
            title: "Defining a Pragmatic and Practical SOA Focused Enterprise Architecture",
            speaker: ["asankaa@wso2.com", "chintana@wso2.com"],
            abstract: " <p>Enterprise architectures today should be agile and adaptable to deliver rapidly changing business requirements. Traditional application architectures were designed and used with systems that existed more than a decade ago. Most enterprises today have stuck with the same outdated architecture for their day-to-day business operations and are looking for alternatives.</p><p>It’s often difficult and expensive to make changes to old systems to support challenging and agile business requirements. Problems such as scaling systems to manage a sudden burst of traffic, provisioning hardware assuming a ballpark peak load instead of going to a cloud-based flexible provisioning scheme, adding new business functionality in a secured, re-usable manner are some of them among many others.</p><p>During this tutorial, learn how you can apply SOA principles to build your enterprise architecture to handle challenging business and technical needs, and learn how the WSO2 enterprise middleware stack can help you to build a platform for rapid application development and deployment.</p>",
            start: new Date(2013,9,29,13,30),
            end: new Date(2013,9,29,17,00),
            location: "TT1",
	    track:3
        },
        {
            id: "t4t02a",
            type: "tutorial",
            title: "Managing Enterprise Mobile Devices and Delivering Enterprise Mobile Applications",
            speaker: ["harshap@wso2.com", "shan@wso2.com"],
            abstract: "",
            start: new Date(2013,9,29,13,30),
            end: new Date(2013,9,29,17,00),
            location: "TT1",
	    track:4
        },
        {
            id: "t5t02a",
            type: "tutorial",
            title: "Introducing Apache Stratos (Incubating) & WSO2 PaaS Foundation",
            speaker: ["paul@wso2.com", "lakmal@wso2.com"],
            abstract: "<p>Enterprise architectures today should be agile and adaptable to deliver rapidly changing business requirements. Traditional application architectures were designed and used with systems that existed more than a decade ago. Most enterprises today have stuck with the same outdated architecture for their day-to-day business operations and are looking for alternatives.</p><p>It’s often difficult and expensive to make changes to old systems to support challenging and agile business requirements. Problems such as scaling systems to manage a sudden burst of traffic, provisioning hardware assuming a ballpark peak load instead of going to a cloud-based flexible provisioning scheme, adding new business functionality in a secured, re-usable manner are some of them among many others.</p><p>During this tutorial, learn how you can apply SOA principles to build your enterprise architecture to handle challenging business and technical needs, and learn how the WSO2 enterprise middleware stack can help you to build a platform for rapid application development and deployment.</p>",
            start: new Date(2013,9,29,13,30),
            end: new Date(2013,9,29,17,00),
            location: "TT1",
	    track:5
        },
        {
            id: "t6t02a",
            type: "tutorial",
            title: "Security and Identity for the Cloud, API, and Mobile World",
            speaker: ["prabath@wso2.com","johann@wso2.com"],
            abstract: "",
            start: new Date(2013,9,29,13,30),
            end: new Date(2013,10,29,17,00),
            location: "TT1",
	    track:6
        },
        {
            id: "break1",
            type: "break",
            title: "Main Agenda End",
            speaker: [],
            abstract: "",
            start: new Date(2013,9,29,17,00),
            end: new Date(2013,9,29,17,00),
            location: "none",
	    track:0
        },
        {
            id: "reg2",
            type: "break",
            title: "Registration",
            speaker: [],
            abstract: "",
            start: new Date(2013,9,30,08,30),
            end: new Date(2013,9,30,09,00),
            location: "lobby",
	    track:0
        },
        {
            id: "opening",
            type: "session",
            title: "Opening",
            speaker: [],
            abstract: "Opening",
            start: new Date(2013,9,30,09,00),
            end: new Date(2013,9,30,09,15),
            location: "main",
	    track:0
        },
        {
            id: "keynote1",
            type: "keynote",
            title: "WSO2 Keynote",
            speaker: ["sanjiva@wso2.com"],
            abstract: "",
            start: new Date(2013,9,30,09,15),
            end: new Date(2013,9,30,09,45),
            location: "main",
	    track:0
        },
        {
            id: "keynote2",
            type: "keynote",
            title: "Keynote: Cutting-edge IT at Boeing: Transforming Commercial Aviation Using WSO2",
            speaker: ["Jim Crabbe"],
            abstract: "<p>Boeing is generally known as the world’s largest aerospace company and aircraft manufacturer. But in addition to being a leader in aerospace world, Boeing also has a major business unit working on the cutting edge of information technology. In a highly-regulated, safety-focused and hyper-competitive industry like aviation, information sharing is of paramount importance – yet security and protection of highly sensitive data is equally critical. To address this challenge, Boeing built the Digital Aviation Platform using WSO2. The cloud-based Digital Aviation Platform is where Boeing integrates its products and services to connect its decades of OEM aircraft data with airline back office systems. The result? Integrated solutions that power airline operations and improve decision making through advanced analytics. In this talk, we'll explore the business drivers behind the project, the challenges met and overcome during design and implementation and the strengths and challenges of WSO2 as a foundation.</p>",
            start: new Date(2013,9,30,09,45),
            end: new Date(2013,9,30,10,30),
            location: "main",
	    track:0
        },
        {
            id: "break2",
            type: "break",
            title: "Break",
            speaker: [],
            abstract: "",
            start: new Date(2013,9,30,10,30),
            end: new Date(2013,9,30,11,00),
            location: "B1",
	    track:0
        },
        {
            id: "t1s01",
            type: "session",
            title: "Re-design Enterprise IT with WSO2 App Factory and WSO2 Cloud",
            speaker: ["chris@wso2.com"],
            abstract: "<p>Disruptive technology forces coupled with increasing business revenue and growth demands provide the catalyst for examining how to redesign Enterprise IT into a more responsive and agile organization.   Re-designing Enterprise IT culture, practices, and architecture is incredibly difficult.  The way to shift the status quo and improve delivery is through grassroots adoption, best practice mentoring, and making the right path the easy path. In this session, Chris will describe how to successfully re-design Enterprise IT practices, achieve responsive iterations, gain effective collaboration, and streamline processes by adopting WSO2 App Factory and WSO2 Cloud.</p>",
            start: new Date(2013,9,30,11,00),
            end: new Date(2013,9,30,11,30),
            location: "T1",
	    track:1
        },
        {
            id: "t2s01",
            type: "session",
            title: "The New ESB - RESTy, Connected, Collaborative, and Optimized",
            speaker: ["kasun@wso2.com"],
            abstract: "<p>Modern Enterprise IT systems are evolving at an immense pace and business requirements are changing at a rapid rate. Enterprise IT systems should quickly respond to business changes with agility. Hence, most organizations adopt SOA as its enterprise architecture owing to the loosely coupled nature and the extensibility of SOA.</p><p>The successful realization of an SOA completely relies on the platform in which is it built on. You need to have a solid foundation to establish your SOA implementation and cater to all the integration needs. As an enterprise integration infrastructure, ESB needs to provide the foundation for SOA implementation and cater to integration requirements of disparate systems, services and protocols. WSO2 ESB brings you the most robust, highest performance, lowest footprint, and most interoperable integration solution.</p><p>In this session, Kasun will discuss the importance of using WSO2 ESB as an integration platform in your SOA. In particular, he will focus on Cloud Connectors, RESTful Integration, Performance aspects, and EIP support in WSO2 ESB.</p>",
            start: new Date(2013,9,30,11,00),
            end: new Date(2013,9,30,11,30),
            location: "T2",
	    track:2
        },
        {
            id: "t1s02",
            type: "session",
            title: "Deploying and Extending Apache Stratos (Incubating) an Open PaaS",
            speaker: ["lakmal@wso2.com"],
            abstract: "<p>Apache Stratos is a polyglot PaaS framework, providing developers a cloud-native environment for developing, testing, and running scalable applications. With Apache Stratos, IT providers will gain high utilization rates, automated resource management, and platform-wide insight including monitoring and billing. Apache Stratos has the ability to run on top of multiple IaaS including OpenStack, vCloud, SUSE Clouds, Rackspace and EC2. The architecture of Stratos is well designed to face current challenges of Cloud PaaS space. With the extensible cartridge model, it supports legacy technologies to move into the Cloud and deliver Cloud benefits.</p><p>During this session, Lakmal will provide an overview of the Apache Stratos architecture.</p>",
            start: new Date(2013,9,30,11,30),
            end: new Date(2013,9,30,12,00),
            location: "T1",
	    track:1
        },
        {
            id: "t2s02",
            type: "session",
            title: "Using the Carbon Architecture To Build a Fit-for-Purpose Platform",
            speaker: ["sameera@wso2.com"],
            abstract: "<p>WSO2 Carbon is an innovative enterprise middleware platform, which allows you to transform your development and operational processes. WSO2 Carbon provides an integrated and componentized middleware stack that adapts to the specific enterprise needs - on premise or in the cloud. WSO2 products, which constitute this data-to-screen middleware platform, are a set of reusable components/modules that run on the WSO2 Carbon platform. You get to choose the right set of components for your enterprise architecture leaving behind those you don’t need. This modular Carbon architecture allows you to build the perfect solution that meets your enterprise needs.</p><p>In this talk, Sameera will discuss the Carbon architecture and how it has helped enterprise architects to build fit-for-purpose enterprise solutions over the past years.</p>",
            start: new Date(2013,9,30,11,30),
            end: new Date(2013,9,30,12,00),
            location: "T2",
	    track:2
        },
        {
            id: "t1s03",
            type: "session",
            title: "The Integration Game Changer: WSO2 Integration Cloud",
            speaker: ["azeez@wso2.com"],
            abstract: "<p>Integration Platform as a Service (iPaaS)is a suite of cloud services that addresses a wide range of integration and governance scenarios. Gartner predicts that by 2016, at least 35% of all large organizations worldwide will be using one or more iPaaS offerings in some form. Businesses looking to leverage the greater flexibility and faster time to market delivered by such offerings in this fledgling market must make note of the benefits a true cloud-native iPaaS delivers and be aware of the pitfalls so they may make an informed decision when selecting a vendor.</p><p>In this session, Azeez will walk you through the integration cloud landscape and introduce WSO2’s iPaaS; WSO2 Integration Cloud, and how it fits into WSO2’s overall cloud strategy.</p>",
            start: new Date(2013,9,30,12,00),
            end: new Date(2013,9,30,12,30),
            location: "T1",
	    track:1
        },
        {
            id: "t2s03",
            type: "session",
            title: "Using WSO2 ESB to integrate Salesforce.com and SAP ERP",
            speaker: ["igor.mameshin@accenture.com"],
            abstract: "<p>In this session, Igor will present a case study using cloud based WSO2 ESB to integrate Salesforce.com and SAP ERP.   Igor will discuss how  WSO2 ESB helps to address integration challenges that IT teams will face, including connectivity, system configuration issues, application customizations, non-functional requirements, reliability, scalability, and security.  You will learn technical implementation details; including how to use WSO2 ESB adapters for connecting to SAP via RFC/Idoc interface, using XSLT for transforming messages between Salesforce and SAP formats, and using OAuth 2.0 for the Salesfoce SOAP API Authentication.  While Salesforce and SAP ERP are used as examples in the live demo, the principles apply to many other SaaS applications and on-premise information systems.  The hub of these integration flows is WSO2 integration middleware, which makes it easy for your apps to connect to all other apps.</p>",
            start: new Date(2013,9,30,12,00),
            end: new Date(2013,9,30,12,30),
            location: "T2",
	    track:2
        },
        {
            id: "t1s04",
            type: "session",
            title: "West Connect Powered by WSO2",
            speaker: ["papatel@west.com"],
            abstract: "<p>West has provided contact center technology solutions and integration for more than two decades. West Connect is a cloud solution that enables organizations to provide an improved, personalized customer experience for their customers. It is an enabling middleware based on service-oriented architecture (SOA) powered by WSO2 that can be leveraged across West services and APIs and provides for multichannel communication. In this session learn about West’s business use-case, architecture, challenges faced and solutions found with help of WSO2.</p>",
            start: new Date(2013,9,30,12,30),
            end: new Date(2013,9,30,13,00),
            location: "T1",
	    track:1
        },
        {
            id: "t2s04",
            type: "session",
            title: "Why Deploy an Enterprise App Store?",
            speaker: ["nuwan@wso2.com"],
            abstract: "<p>Application discovery is considered equally important as composing them. When an organization has a growing need in information presentation, there will be all sorts of applications created to deliver business-critical information for intended parties. Of course an organization can publish the list of applications flat out in the corporate intranet, or they can deploy an enterprise asset store to provide a whole new meaning to application discovery. A store not just enables the provision of app URLs, but will create an app economy within the organization, providing a social platform integrating the app consumer and the application itself.</p><p>During this session, Nuwan will discuss the importance of having an Enterprise Application Store, how it can create organized app discovery, a social platform for sorting and searching assets, and also how it can enable an application economy within an organization.</p>",
            start: new Date(2013,9,30,12,30),
            end: new Date(2013,9,30,13,00),
            location: "T2",
	    track:2
        },
        {
            id: "lunch2",
            type: "break",
            title: "Lunch",
            speaker: [],
            abstract: "",
            start: new Date(2013,9,30,13,00),
            end: new Date(2013,9,30,14,00),
            location: "B2",
	    track:0
        },
        {
            id: "t1s05",
            type: "session",
            title: "Re-Thinking Enterprise SOA & IT Governance",
            speaker: ["senaka@wso2.com"],
            abstract: "<p>Enterprise SOA is a design pattern where you build re-usable functions or activities as a set of self-contained, loosely-coupled services. IT governance focuses on direction and control of operations, by granting people rights and responsibilities over processes, while conforming to a series of policies.</p><p>SOA governance has been in existence for over five years; however, most enterprises have not reaped all its benefits. Complexity of requirements, diversity of tools, and implementation costs are examples of several roadblocks faced. In this session, Senaka will discuss these challenges and highlight WSO2’s strategy in re-thinking how enterprise SOA and IT governance tie-up together.</p>",
            start: new Date(2013,9,30,14,00),
            end: new Date(2013,9,30,14,30),
            location: "T1",
	    track:1
        },
        {
            id: "t2s05",
            type: "session",
            title: "Weapons Free: Open Source Solutions to Programmatic and Operational Challenges Faced by the Defense and Intelligence Communities in the Age of Sequestration",
            speaker: ["adam@wso2.com"],
            abstract: "<p>This session explores major challenges faced by technology acquisition organizations in an era of shrinking government budgets and legislated spending caps. It will also provide case studies of innovative solutions enabled by open source software. Topics that will be covered include (but may not be limited to): a. The Legal and Policy Basis for Government Use of Open Source Software, b. Transformation of Legacy Systems, c. Integration of Legacy Capabilities, d. Cross-Organizational Data Integration, e. Improving Cyber Warfare Posture. The information provided will be unclassified and compliant with US export control laws and regulations.</p>",
            start: new Date(2013,9,30,14,00),
            end: new Date(2013,9,30,14,30),
            location: "T2",
	    track:2
        },
        {
            id: "t1s06",
            type: "session",
            title: "Case Study: Reflections on Enabling Change in Healthcare with SOA",
            speaker: ["paul.tjapkes@spectrumhealth.org"],
            abstract: "<p>To be successful at SOA, follow a SOA roadmap! In this presentation, Paul will describe the Spectrum Health SOA prioritization process, the SOA infrastructure stack  (WSO2 ESB, WSO2 Governance Registry, WSO2 Business Activity Monitor, WSO2 Identity Server),  intake artifacts.  The presentation will also describeguidance practices used to define enterprise and application services, identify standards, use SOAP or REST design, and achieve web services security.</p>",
            start: new Date(2013,9,30,14,30),
            end: new Date(2013,9,30,15,00),
            location: "T1",
	    track:1
        },
        {
            id: "t2s06",
            type: "session",
            title: "A Case Study Using WSO2 Middleware in an Enterprise SOA Infrastructure in Support of a US Military Weapon System",
            speaker: ["JoEllenElizabethRose@gmail.com"],
            abstract: "<p>In this presentation, Joellen delivers a case study describing how WSO2 middleware was  applied to a US military weapon system. Faced with unsustainable maintenance costs and a decades-old design paradigm, the existing system was completely re-designed as an enterprise SOA infrastructure.  Joellen will present an overview of the system requirements, solution design, and the WSO2 middleware core architecture. The presentation will include the architecture, design, and how this design was enabled by using open source middleware, and the adherence of the middleware to open standards. While a very intriguing and forward looking story, the presentation will contain no classified information, and will comply with all AECA and ITAR requirements.</p>",
            start: new Date(2013,9,30,14,30),
            end: new Date(2013,9,30,15,00),
            location: "T2",
	    track:2
        },
        {
            id: "t1s07",
            type: "session",
            title: "Advanced API Management Tactics",
            speaker: ["isabelle@wso2.com"],
            abstract: "<p>You already know that API Manager can help you expose, secure and monitor APIs. In this session, we will explain how much more you can achieve, leveraging the WSO2 platform:</p><ul style=\"margin:0px 0px 0px 30px;\"><li>How the API Manager can generate and cache JWT/SAML tokens for back-end consumption</li><li>How you can enhance the API gateway to be much more than a reverse proxy</li><li>How you can associate API Manager with an Identity Server to further authorize API access</li><li>How you can leverage our CEP server to react to API calls patterns</li></ul><p>All of these scenarios will be illustrated using a live demo.</p>",
            start: new Date(2013,9,30,15,00),
            end: new Date(2013,9,30,15,30),
            location: "T1",
	    track:1
        },
        {
            id: "t2s07",
            type: "session",
            title: "Identity Management Best Practices with WSO2 Identity Server",
            speaker: ["johann@wso2.com"],
            abstract: "<p>The world of Identity and Access management is most often than not seen as a domain of jargons that not many tech folks can comprehend. How do these standards relate with one another? What standards are needed for your enterprise? What standards do WSO2 Identity Server support? Can WSO2 Identity Server be set up in your ecosystem without bringing about any disruption?</p><p>In this session, Johann will give you a glimpse of how WSO2 Identity Server can seamlessly integrate with your existing enterprise middleware and application software, which could encompass web, mobile and desktop clients, centrally manage and expose your user identities as services, and verify, control and audit access by them.</p>",
            start: new Date(2013,9,30,15,00),
            end: new Date(2013,9,30,15,30),
            location: "T2",
	    track:2
        },
        {
            id: "t1s08",
            type: "session",
            title: "Thinking of you. Customizing the store of the WSO2 API Manager for the non programmer",
            speaker: ["ebaste@molinodeideas.es"],
            abstract: "<p>The API world is making true one of the last ideas of the Xerox  Palo Alto Design Center engineer, Alan Kay. Every user of a computer may be a programmer.   We are working to make it real thanks to the API world.   But we need to work in making the resources simply. We need to develop metaphors that makes intiuitive the use of the functions offered.   Based in WSO2 api manager, in Apicultur, we are working in the adaptation of the interface of the store to the non programmer user. Even the non programmer user can supply APIs to the world!</p>",
            start: new Date(2013,9,30,15,30),
            end: new Date(2013,9,30,16,00),
            location: "T1",
	    track:1
        },
        {
            id: "t2s08",
            type: "session",
            title: "Securing Cloud and Mobile: Pragmatic Enterprise Security Architecture",
            speaker: ["prabath@wso2.com"],
            abstract: "<p>Cloud and Mobile are two key terminologies at the heart of any enterprise dealing with serious business today.Moving the storage and the processing power to the Cloud and exposing business functions through APIs is the most common use case among the rest. APIs can be accessed through traditional web applications or through native mobile applications. Either way, security is an essential ingredient in each move.</p><p>In this session Prabath will build an architecture and discuss a pragmatic approach to deal with risks, threats and vulnerability associated with Cloud and Mobile.</p>",
            start: new Date(2013,9,30,15,30),
            end: new Date(2013,9,30,16,00),
            location: "T2",
	    track:2
        },
        {
            id: "break3",
            type: "break",
            title: "Break",
            speaker: [],
            abstract: "",
            start: new Date(2013,9,30,16,00),
            end: new Date(2013,9,30,16,30),
            location: "B1",
	    track:0
        },
        {
            id: "keynote3",
            type: "keynote",
            title: "Keynote: Building an Enterprise PaaS framework using Open Source Components",
            speaker: ["Prakash_Iyer@trimble.com"],
            abstract: "<p>In this session, Prakash will describe how any enterprise who is thinking about building a scalable cloud solution can leverage WSO2 open source technology, build their PaaS foundation layer, save time and money, and focus on delivering business value.</p>",
            start: new Date(2013,9,30,16,30),
            end: new Date(2013,9,30,17,15),
            location: "main",
	    track:0
        },
        {
            id: "keynote4",
            type: "keynote",
            title: "Keynote: Creating the API Centric Enterprise: Towards a Connected Business",
            speaker: ["john@wso2.com"],
            abstract: "<p>API Centric is a combination of API Management, Enterprise Store, Mobile, App Factory applied inside a corporation to facilitate better management and use of enterprise assets such as services, data, applications, mobile applications. Moreover, an organization can have a way of understanding the use and value of all the IT assets it is creating or using. API Centric leverages all the WSO2 products to create a revolutionary social self-aware IT infrastructure. Understand why WSO2 is building all the products it is, and why they all are pieces in a puzzle to help organizations and individual developers become more productive. John’s talk will focus on the connected business and how the disruptive forces in the enterprise space are creating new ways to manage the enterprise IT assets that foster re-use, rapid integration of innovation both inside and outside an organization. </p>",
            start: new Date(2013,9,30,17,15),
            end: new Date(2013,9,30,18,00),
            location: "main",
	    track:0
        },
        {
            id: "break4",
            type: "break",
            title: "Main Agenda End",
            speaker: [],
            abstract: "",
            start: new Date(2013,9,30,17,15),
            end: new Date(2013,9,30,17,15),
            location: "none",
	    track:0
        },       
        {
            id: "reg3",
            type: "break",
            title: "Registration",
            speaker: [],
            abstract: "",
            start: new Date(2013,9,31,08,30),
            end: new Date(2013,9,31,09,00),
            location: "none",
	    track:0
        },
        {
            id: "keynote3",
            type: "keynote",
            title: "Keynote: APIs Driving the Stubhub Business",
            speaker: ["smalladi@stubhub.com"],
            abstract: "",
            start: new Date(2013,9,31,09,00),
            end: new Date(2013,9,31,09,45),
            location: "main",
	    track:0
        },
        {
            id: "keynote4",
            type: "keynote",
            title: "Keynote: Developing Enterprise Apps In the Cloud",
            speaker: ["Tyler"],
            abstract: "<p>Developers spend 13 hours per week administering their desktop development environments. Cloud development can give back 10 billion hours of lost productivity each year. Centralizing development makes it possible for anyone to provision environments to code, build, test, and deploy applications increasing efficiency and control while opening up development for under served teams like commuters, offshore groups, API consumers, support, and hackathons.</p><p>This session will present a vision for cloud development in the enterprise. Cloud's resources, when applied to development workflows, can make them shorter and less error prone. We'll discuss our approach to building development clouds and how we are partnering with WSO2 to open up a new world of development of enterprise applications.</p>",
            start: new Date(2013,9,31,09,45),
            end: new Date(2013,9,31,10,30),
            location: "main",
	    track:0
        },
        {
            id: "break5",
            type: "break",
            title: "Break",
            speaker: [],
            abstract: "",
            start: new Date(2013,9,31,10,30),
            end: new Date(2013,9,31,11,00),
            location: "B1",
	    track:0
        },
        {
            id: "t1s09",
            type: "session",
            title: "Achieving Safe BYOD and Productive Apps with WSO2 Mobile Device Management and Mobile Application Management",
            speaker: ["shan@wso2.com"],
            abstract: "<p>Smartphone mobile devices and mobile applications are flooding the market, and employees bringing their own devices to the workplace to access corporate data will no doubt increase productivity, but at the same time manageability and security becomes a big threat to the enterprise. Every enterprise IT today should be aware of every smartphone and tablets used in an organization starting from activation to retirement. Accomplishing this requires a very good plan for mobile device management.</p><p>With enterprises embracing the BYOD concept, there is also a need to build enterprise centric mobile enterprise applications. Application discovering, distributing and protecting corporate data is a huge challenge for the corporate.</p><p>In this session, Shan will talk about how WSO2 MDM and WSO2 MAM will enable an organization to achieve safe BYOD and bringing productive applications built by the organization to discovery and distribution, and at the same time adhering to corporate policies.</p>",
            start: new Date(2013,9,31,11,00),
            end: new Date(2013,9,31,11,45),
            location: "T1",
	    track:1
        },
        {
            id: "t2s09",
            type: "session",
            title: "Establishing an SOA-Focused Enterprise Architecture",
            speaker: ["asankaa@wso2.com"],
            abstract: "<p>A service-oriented architecture (SOA) can help boost execution of enterprise architecture (EA) by utilizing concepts such as loose-coupling, reusability, and shared services. The SOA architecture style can be used to adopt patterns and standards across the enterprise by inheriting EA frameworks.</p><p>In this session, Asanka will discuss how to improve and fix EA blueprints, using SOA, by reusing existing application software and middleware running in the enterprise. In addition, he will discuss in detail a roadmap to adoption along with a few patterns, including a business services platform. The WSO2 Enterprise Middleware platform and solutions will be used to highlight implementation details.</p>",
            start: new Date(2013,9,31,11,00),
            end: new Date(2013,9,31,11,45),
            location: "T2",
	    track:2
        },
        {
            id: "t1s10",
            type: "session",
            title: "APIs Everywhere: Turning All Services into Managed APIs",
            speaker: ["sumedha@wso2.com"],
            abstract: "<p>Are your SOA efforts paying off? How many services are being re-used? Are they really being managed to facilitate re-use?</p><p>A managed API has many faces; a solid functional implementation, a well-defined interface, documentation, subscription capabilities, and a standard model for authentication and authorization are some of them. A service-enabled functionality cannot go much further without the characteristics a managed API has. The need for subscription to use a service is hardly discussed in the SOA world. How well does that fit into today’s world of an app economy? What is the purpose of a service that is being re-used only once? And more importantly, how do you determine how and when it is being re-used? How can the life of an application developer be made easy with a unified API access model for application  development? These are some key questions that prevail on architecture that follow SOA.</p><p>A managed API has more solid, standard answers to all of the above. In other words, it completes the picture the SOA promises to deliver.</p><p>Over the years, the WSO2 platform has developed the ability to service enable almost any business functionality of an enterprise. Now, we focus on how to convert these services into managed APIs.</p> <p>In this talk, Sumedha will discuss</p><ul style=\"margin:0px 0px 0px 30px;\"><li>Why API management and the promise of SOA go hand in hand</li><li>How API management will be injected to every service creation capability within the WSO2 platform</li><li>Its promise to end users</li><li>What the new WSO2 platform will look like with API management everywhere</li></ul>",
            start: new Date(2013,9,31,11,45),
            end: new Date(2013,9,31,12,30),
            location: "T1",
	    track:1
        },
        {
            id: "t2s10",
            type: "session",
            title: "Rapidly Building Complex Applications with WSO2 App Factory",
            speaker: ["shankar@wso2.com"],
            abstract: "<p>Collaborative application development and lifecycle management of applications is a real challenge in most organizations. When there are hundreds of applications and multiple teams involved in the development stage, proper tools and infrastructure in various lifecycle stages and proper application governance across these stages are essential to achieve success.</p><p>WSO2 App Factory helps you to solve these problems by managing life cycle stages, such as development, testing, pre-production, and production, and integrating SDLC tools that are necessary in each of these stages. Developers and other team members can self-manage the application by using a self-service portal. This enables an on-demand, agile application development environment that helps transform how you manage your IT.</p> <p>During the session, Shankar will show the features of WSO2 App Factory, including how to develop an application, take the application through various lifecycle stages and use various tools in each lifecycle stage.</p>",
            start: new Date(2013,9,31,11,45),
            end: new Date(2013,9,31,12,30),
            location: "T2",
	    track:2
        },
        {
            id: "t1s11",
            type: "session",
            title: "Powering an enterprise with messaging and APIs",
            speaker: ["abrown@barclaycardus.com"],
            abstract: "<p>BarclaycardUS has utilized the WSO2 ESB to integrate with our back end service providers using multiple protocols with very high volumes.  The interfaced providers are primarily SOAP over MQ or HTTP(S) based, but other interfaces including the mobile interface utilize REST.  Security is implemented with WS-Security currently for SOAP and will be implementing OAuth by years end for mobile.  This presentation will discuss the basic solution as well as the hurdles encountered with bringing the WSO2 stack into our environment including performance, monitoring and SLA management.</p><p>Learning:</p><ol> <li>Integrating the ESB with an existing SOA environment.</li><li>Leveraging the REST API with the ESB.</li><li>Managing SSL x509 based security along with WS-Security username/token profile in the ESB.</li><li>Managing 10 distinct environment with the WSO2 stack.</li><li>Performance and monitoring in the enterprise.</li><li>API governance and continuous integration.</li></ol>",
            start: new Date(2013,9,31,12,30),
            end: new Date(2013,9,31,13,00),
            location: "T1",
	    track:1
        },
        {
            id: "t2s11",
            type: "session",
            title: "Using Jaggery in Telecom Web and Mobile Applications",
            speaker: ["Cesar"],
            abstract: "<p>It is difficult to determine a good architecture with many layers in a collaboration environment where people can build different applications types. With HTML5 applications that can be used everywhere security is a important feature to consider too. It is also challenging to have a front-end team with knowledge about all layers in a complex back-end structure. Therefore it's important to have an architecture where you can combine these two environments creating a web app and its APIs. With the some features from Jaggery you can resolve these problems. We were able to</p><ul style=\"margin:0px 0px 0px 30px;\"><li>Grant access to some resources using OAuth.</li><li>Call our Coreo App Engine web service that the application has to execute and check the App Engine responses with a WebSocket.</li><li>With the internationalization module we easily provided the user application texts in some languages that the system already stores in JSON files.</li></ul><p>In this session I will show how we built this environment using Jaggery.</p>",
            start: new Date(2013,9,31,12,30),
            end: new Date(2013,9,31,13,00),
            location: "T2",
	    track:2
        },
        {
            id: "lunch3",
            type: "break",
            title: "Lunch",
            speaker: [],
            abstract: "",
            start: new Date(2013,9,31,13,00),
            end: new Date(2013,9,31,14,00),
            location: "none",
	    track:0
        },
        {
            id: "t1s12",
            type: "session",
            title: "One blueprint and a multitude of applications - How WSO2 Middleware powers Deutsche Telekoms connected car platform architecture",
            speaker: ["thomas.wieger@t-systems.com"],
            abstract: "<p>The strategic Connected Car group of Deutsche Telekom has worked for several years defining a connected car platform architecture blueprint. This blue print is based on a service oriented architecture, powered by most of WSO2s middleware products.  With this blueprint, Deutsche Telekom has developed a multitude of applications in eMobility (electric cars), infotainment, safety, comfort areas for various target groups. Example groups include car drivers, OEMs, dealers/workshops, or fleet operators. In his presentation, Thomas Wieger will show central connected car platform architecture elements and the important role wso2 middleware is playing in this blueprint. and He will also describe a few real life applications that realize the blueprint.</p>",
            start: new Date(2013,9,31,14,00),
            end: new Date(2013,9,31,14,30),
            location: "T1",
	    track:1
        },
        {
            id: "t2s13",
            type: "session",
            title: "View, Act, and React: Shaping Business Activity with Analytics, BigData Queries, and Complex Event Processing",
            speaker: ["srinath@wso2.com"],
            abstract: "<p>Sun Tzu said “if you know your enemies and know yourself, you can win a hundred battles without a single loss.” Those words have never been truer than in our time. We are faced with an avalanche of data. Many believe the ability to process and gain insights from a vast array of available data will be the primary competitive advantage for organizations in the years to come.</p><p>To make sense of data, you will have to face many challenges: how to collect, how to store, how to process, and how to react fast. Although you can build these systems from bottom up, it is a significant problem. There are many technologies, both open source and proprietary, that you can put together to build your analytics solution, which will likely save you effort and provide a better solution.</p><p>In this session, Srinath will discuss WSO2’s middleware offering in BigData and explain how you can put them together to build a solution that will make sense of your data. The session will cover technologies like thrift for collecting data, Cassandra for storing data, Hadoop for analyzing data in batch mode, and Complex event processing for analyzing data real time.</p>",
            start: new Date(2013,9,31,14,00),
            end: new Date(2013,9,31,14,30),
            location: "T2",
	    track:2
        },
        {
            id: "t1s14",
            type: "session",
            title: "Enterprise Activity Engine using WSO2 Ecosystem",
            speaker: ["rajesh.kaveti@bnymellon.com"],
            abstract: "<p>Activity Engine is providing management and operations personnel with immediate awareness of business events and changing business conditions across the enterprise. The solution provides an extensible framework, which consume and persists events along with computing complex events aggregations at high speeds. These event processing actions will correlate events and identify patterns emanating from various business participants.  Stakeholders will have instant visibility into key business events in real time. This project is based on using WSO2 platform products including CEP, BAM and ESB.</p>",
            start: new Date(2013,9,31,14,30),
            end: new Date(2013,9,31,15,00),
            location: "T1",
	    track:1
        },
        {
            id: "t2s14",
            type: "session",
            title: "Store and Deliver Data to the Mobile App Edge: WSO2 Storage-as-a-Service and Data-as-a-Service",
            speaker: ["anjana@wso2.com"],
            abstract: "<p>Mobile applications are becoming the next big thing! People are moving more and more toward mobile platforms compared to its desktop cousins. Therefore, efficient mobile application creation has become critical. And as with any application, data is core. You will run your business logic against some data to output something useful. To access this data, the user has to have a data source to begin with. Especially in a cloud environment, the users will have limited capabilities to plug into your own existing data source. So, there is a requirement of a data source provisioning system. After the acquisition of a data source, the next step is to have a mechanism to access/manipulate the data in an efficient manner.</p><p>Anjana will discuss how WSO2 Storage Server can be used for data source provisioning in your environment, which will contain functionalities to create and manage relational databases and NoSQL data stores as well. He will also look at how WSO2 Data Services Server can be used to access that data, where it has more mobile friendly, native support for data formats such as JSON and RESTful data access.</p>",
            start: new Date(2013,9,31,14,30),
            end: new Date(2013,9,31,15,00),
            location: "T2",
	    track:2
        },
        {
            id: "t1s15",
            type: "session",
            title: "Delivering Big IT Transformation Using Open Source",
            speaker: ["neeraj"],
            abstract: "<p>Cloud DevOps increases productivity, optimizes run-time resource footprint, and efficiently manages a complex, dynamic cloud environment.  Teams integrating development activities with operations activities (adopting DevOps) require visibility across the entire Cloud application stack.   By deploying Apache Stratos PaaS on OpenStack IaaS, teams gain a holistic view of monitoring, management, security, provisioning, and performance management, across application and infrastructure perspectives.   In this session, presenters will illustrate why PaaS should not be a dumb workload on IaaS, and how bridging IaaS with PaaS maximizes cloud benefits while decreasing cloud complexity.   The session will describe the value in cross-ecosystem collaboration between OpenStack and Apache Stratos, and specific call to action areas where participants can differentiate OpenStack powered Clouds.</p>",
            start: new Date(2013,9,31,15,00),
            end: new Date(2013,9,31,15,30),
            location: "T1",
	    track:1
        },
        {
            id: "t2s15",
            type: "session",
            title: "Apache Stratos on OpenStack",
            speaker: ["frego@novell.com,chris@wso2.com"],
            abstract: "<p>Cloud DevOps increases productivity, optimizes run-time resource footprint, and efficiently manages a complex, dynamic cloud environment.  Teams integrating development activities with operations activities (adopting DevOps) require visibility across the entire Cloud application stack.   By deploying Apache Stratos PaaS on OpenStack IaaS, teams gain a holistic view of monitoring, management, security, provisioning, and performance management, across application and infrastructure perspectives.   In this session, presenters will illustrate why PaaS should not be a dumb workload on IaaS, and how bridging IaaS with PaaS maximizes cloud benefits while decreasing cloud complexity.   The session will describe the value in cross-ecosystem collaboration between OpenStack and Apache Stratos, and specific call to action areas where participants can differentiate OpenStack powered Clouds.</p>",
            start: new Date(2013,9,31,15,00),
            end: new Date(2013,9,31,15,30),
            location: "T2",
	    track:2
        },
        {
            id: "break6",
            type: "break",
            title: "Break",
            speaker: [],
            abstract: "",
            start: new Date(2013,9,31,15,30),
            end: new Date(2013,9,31,16,00),
            location: "B1",
	    track:0
        },
        {
            id: "keynote5",
            type: "keynote",
            title: "Keynote: Facing Born Mobile Generation Challenges in the Enterprise",
            speaker: ["harshap@wso2.com"],
            abstract: "<p>A new generation is born, and they are mobile. The mobile generation is not related to a particular age, but reflects a new generation of consumers and business participants who are exploring new possibilities created by the explosive growth of smart mobile devices.</p><p>Leading organizations have been implementing mobile technology that enables mobile generation use cases across employees, suppliers, partners, and customers. In the future, every single participant will be equipped with a smart mobile device, unleashing immense opportunity to re-invent how organizations interact with employees, suppliers, partners and customers. Mobile technology is becoming one of the biggest focus areas in the enterprise today. The question is, are we ready for this paradigm shift? This session will discuss challenges ranging from proliferation of diverse smart devices to building mobile applications for the new enterprise and emerging mobile landscape.</p>",
            start: new Date(2013,9,31,16,00),
            end: new Date(2013,9,31,16,45),
            location: "main",
	    track:0
        },
        {
            id: "keynote5",
            type: "keynote",
            title: "Closing Keynote",
            speaker: ["paul@wso2.com"],
            abstract: "<p>WSO2 has a vision of Connected Business - using cloud, APIs and mobile apps to change the way businesses work. In this keynote, Paul Fremantle, CTO and Co-Founder of WSO2, will take this vision and show how it can be made real in simple, effective agile iterations. Using real customer case studies as a guide, Paul will show how open source technology can revolutionize business models and create a more agile enterprise infrastructure.</p>",
            start: new Date(2013,9,31,16,45),
            end: new Date(2013,9,31,17,30),
            location: "main",
	    track:0
        },
        {
            id: "break7",
            type: "break",
            title: "Main Agenda End",
            speaker: [],
            abstract: "",
            start: new Date(2013,9,31,17,30),
            end: new Date(2013,9,31,17,30),
            location: "none",
	    track:0
        }
    ]
};
