var baseprofiles = {
    profiles: [
        {
            id: "adam@wso2.com",
            firstname: "Adam",
            lastname: "Firestone",
	        image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Adam.png",
            title: "Director, Defense and Government Solutions",
            organisation: "WSO2",
            bio: "<p>Adam works across the scope of the WSO2 team to understand and craft technology solutions for the unique challenges faced by military, intelligence and government organizations.</p><p>He works closely with developers, architects and C-Level executives to increase the footprint and value offered by open-source software in general and WSO2 products specifically to the military and defense communities. He also works with the engineering team to ensure that WSO2’s product and technology roadmaps retain and develop features situated to support emerging defense and government requirements. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "Washington DC, USA",
            interests: "",
            accepting: 1
        },
        {
            id: "azeez@wso2.com",
            firstname: "Afkham",
            lastname: "Azeez",
 	    image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Azeez.png",
            title: "Director, Architecture",
            organisation: "WSO2",
            bio: "<p>Afkham’s key role is to drive efforts focused on the development and enhancement of WSO2 middleware.</p><p>He is an elected member of the Apache Software Foundation and also a Project Management Committee member and long-time committer for a number of projects. He specializes in distributed computing, highly available and scalable applications, Java 2 Platform Enterprise Edition (J2EE) technologies, and service-oriented architecture.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },       
        {
            id: "abrown@barclaycardus.com",
            firstname: "Alex",
            lastname: "Brown",
            image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/alex.png",
            title: "Group Lead",
            organisation: "BarclaycardUS",
            bio: "<p>Alex has been developing enterprise software solutions for over 15 years as a consultant and as a member of BarclaycardUS. He is the group lead of the core services group at BarclaycardUS, which provides core services to the rest of the organization through data services (service-oriented architecture). The core services group also establishes the standards and governance for service architecture and design including the implementation stack that includes the WSO2 ESB and Governance server.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },    
        {
            id: "anjana@wso2.com",
            firstname: "Anjana",
            lastname: "Fernando",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Anjana.png",
            title: "Technical Lead",
            organisation: "WSO2",
            bio: "<p>Anjana is a technical lead and a member of the Data Technologies Management Committee that focuses on the development of the WSO2 Data Services Server. He has carried out several onsite customer engagements, primarily focused on integration enabled by the WSO2 Enterprise Service Bus.</p><p>He is a contributor to Apache Axis2, and participated in the Google Summer of Code 2006 where we worked on the Apache Mirae project in implementing a multimedia messaging service transport. He also has experience in mobile computing, service-oriented architecture for the European Union’s Information Society Technologies, and Java enterprise Web development.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },   
        {
            id: "asankaa@wso2.com",
            firstname: "Asanka",
            lastname: "Abeysinghe",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Asanka.png",
            title: "VP, Solutions Architecture",
            organisation: "WSO2",
            bio: "<p>Asanka focuses on the company’s vertical market capabilities, including financial services. Additionally, he provides consulting and conducts regular training sessions and workshops for enterprise IT architects and developers.</p><p>He has more than 10 years of industry experience implementing projects that range from desktop and Web applications through to highly scalable distributed systems and service-oriented architectures in the financial domain, mobile platforms, and business integration solutions.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },   
        {
            id: "chamith@wso2.com",
            firstname: "Chamith",
            lastname: "Kumarage",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Chamith.png",
            title: "Technical Lead",
            organisation: "WSO2",
            bio: "<p>Chamith, who is also Manager of Infrastructure, currently oversees WSO2’s overall system and network operations.</p><p>He has over five years of experience in systems and network administration. He was an original author of the Texplorer Project http://texplorer.sourceforge.net and has interests in platform and infrastructure virtualization, distributed computing, IT security, load balancing, cloud monitoring and backup systems.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        }, 
        {
            id: "charitha@wso2.com",
            firstname: "Charitha",
            lastname: "Kankanamge",
	    	image: "",
            title: "Senior Manager, Support",
            organisation: "WSO2",
            bio: "<p>Charitha is Senior Manager, Technical Support. He joined WSO2 in 2006 as Manager, Quality Assurance and has been involved in the product releases of WSO2 SOA middleware platform from its inception.</p><p>He is an active Apache committer and contributed to the Apache Axis2 project. In addition, he is an expert in SOA testing, agile testing, test automation, and performance testing, and has worked with a range of testing tools and technologies. Charitha authored the “Web Services Testing with soapUI” book and was a featured speaker at WSO2Con 2011 held in Colombo, Sri Lanka. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        }, 
        {
            id: "chintana@wso2.com",
            firstname: "Chintana",
            lastname: "Wilamuna",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/chintana.gif",
            title: "Software Architect",
            organisation: "WSO2",
            bio: "<p>Chintana is a software architect on the solution architecture team, focusing on infrastructure development. He also started the WSO2 Web Services Frameworks for Ruby and Perl. In addition to his product development efforts, he has provided technology consulting on customer engagements, including architectural guidance, integration of Web services, print process automation, and online management solutions.</p><p>He is a committer on the Apache Stonehenge project. He specializes in distributed and parallel computing, programming languages, functional programming, high scalable architectures and cloud computing, and has published numerous articles and led WSO2 technical webinars and workshops on a variety of cloud topics, including setting up an in-house private cloud, mobile application development, and enterprise integration.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        }, 
        {
            id: "chris@wso2.com",
            firstname: "Chris",
            lastname: "Haddad",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Chris.png",
            title: "VP, Technology Evangelism",
            organisation: "WSO2",
            bio: "<p>Chris is responsible for raising visibility, awareness, and knowledge of the unique advantages provided by WSO2’s lean, fully componentized, open source middleware for on-premise and in the cloud.</p><p>He works closely with developers, architects, and C-level executives to increase WSO2 technology adoption, improve the middleware platform, and maximize customer value. He also works with the engineering team to define the product roadmaps for WSO2’s Carbon and Stratos platforms.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "ebaste@molinodeideas.es",
            firstname: "Eduardo",
            lastname: "Basterrechea",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/eduardo.png",
            title: "CEO",
            organisation: "Molino De Ideas SA",
            bio: "<p>Eduardo is the Founder of his company that focuses on Natural Language Processing and Apicultur, the platform of linguistic APIs. He is also an engineer who claims to have found his field of study in language and believes that language goes a step further in representing and portraying reality. His mantra involves thinking in words, working in language, and giving the world the best tools for the brain with the aim of trying to make the world a better place for all.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "harshap@wso2.com",
            firstname: "Harsha",
            lastname: "Purasinghe",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/harshap.jpg",
            title: "CEO & Founder",
            organisation: "WSO2 Mobile",
            bio: "<p>Harsha is a serial entrepreneur who founded 3 software companies and a number of successful products since his debut in software industry at the age of 19. Harsha founded Microimage in 1993, and in 2007, Microimage Mobile Media. In 2013, Harsha founded WSO2 Mobile to build a suite of lean, enterprise, mobileware to solve enterprise mobility challenges. This was incorporated as a fully-owned subsidiary of WSO2 Inc., the leading open source middleware company. Harsha has won many awards for leadership and entrepreneurship.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "harshana@wso2.com",
            firstname: "Harshana",
            lastname: "Martin",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Harshana.png",
            title: "Associate Technical Lead",
            organisation: "WSO2",
            bio: "<p>Harshana, who is also a member of the Development Technologies Management Committee, focuses on the WSO2 Developer Studio integrated development environment. He has contributed to several WSO2 QuickStart development consulting engagements.</p><p>Moreover, he participated in the Google Summer of Code program in both 2009 and 2010 with the Eclipse Foundation, and is currently a committer for the Eclipse Communication Framework. He is also an active contributor to the Apache Axis2 project. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "igor.mameshin@accenture.com",
            firstname: "Igor",
            lastname: "Mameshin",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/igor.png",
            title: "Manager",
            organisation: "Accenture",
            bio: "<p>Igor, who is a Manager within the Accenture Cloud Platform (ACP) program, leads a team of software engineers responsible for the hybrid cloud integration platform services developed and delivered through ACP. For the last few years, Igor’s key focus areas have included cloud architectures, highly scalable infrastructure, web-based services, and hybrid cloud integration solutions. He has extensive technical knowledge of middleware, Java, open source, and enterprise application integration.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "isabelle@wso2.com",
            firstname: "Isabelle",
            lastname: "Mauny",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Isabell.jpg",
            title: "Director, Product Management",
            organisation: "WSO2",
            bio: "<p>Isabelle brings to her role nearly 20 years of technology, consulting, and management experience in Java, application development, middleware, and service-oriented architecture. She recently managed the API Manager beta program and has been helping customers around the globe adopting this product. In her role, she works closely with the WSO2 engineering, sales, and marketing teams. She strongly believes that successful product management requires a great understanding of our customers and the problems they hope to resolve, as well as a strong understanding of the products themselves. Hence, Isabelle regularly participates in WSO2 QuickStart programs and services engagements.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "JoEllenElizabethRose@gmail.com",
            firstname: "Joellen",
            lastname: "Rose",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/rose.png",
            title: "",
            organisation: "",
            bio: "<p>Joellen has experience in providing software systems engineering support for the US military. After completing a bachelor’s degree in Aerospace Engineering at the United States Naval Academy, she served as a Nuclear Surface Warfare Officer. Since separating from active duties, she has worked in the Marine Renewable Energy industry, and as an analyst supporting the Commander of US Navy Surface Forces. She also holds a Master’s in Engineering Management.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "johann@wso2.com",
            firstname: "Johann",
            lastname: "Nallathamby",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/johann.gif",
            title: "Senior Software Engineer",
            organisation: "WSO2",
            bio: "<p>Johann is a Sun Certified Java Programmer and is currently reading for his certification in management accountancy from the Chartered Institute of Management Accountants. Prior to WSO2, he completed an internship at WaveNET International (Pvt.) Ltd where he was a part of the SMSC team and is an expert in the area of logging aspects of the SS7 infrastructure for SMS. As his final year project, Johann worked on deBas - a Sinhala Interactive Voice Response system. He holds a Bachelor of Science in Engineering.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "john@wso2.com",
            firstname: "John",
            lastname: "Mathon",
	   	 	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/john-mathon.gif",
            title: "VP, Product Marketing",
            organisation: "WSO2",
            bio: "<p>John Mathon joined WSO2 in 2013 and he currently serves as Vice President of Product Marketing. As a founder of TIBCO software and inventor of the publish / subscribe paradigm he helped establish TIBCO as the leading middleware provider in the world. He has spent more than 20 years working on enterprise software for corporations worldwide. Prior to joining WSO2, John started other companies, created numerous patents and has been a visionary for enterprise software. Besides TIBCO, he started Slam Dunk Networks now known as Cloud Prime, Mathon Systems in the DLP space, and has helped CA Technologies move to the cloud and SaaS.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "kasun@wso2.com",
            firstname: "Kasun",
            lastname: "Indrasiri",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/KasunI.png",
            title: "Software Architect",
            organisation: "WSO2",
            bio: "<p>Kasun, who is also a member of the Integration Technologies Management Committee, focuses on the WSO2 Enterprise Service Bus. In addition to his product development efforts, he has provided technology consulting on customer engagements, helping to successfully implement solutions for integrating Web services, SAP, FIX, and mobile services.</p><p>He is an elected member of the Apache Software Foundation and a Project Management Committee member and committer for the Apache Synapse open source ESB project. He took part in the Google Summer of Code for 2007, working on the Apache Axis2/C project. He also contributed to the Apache Rampart/C project, having implemented WS-Trust specification for its federated identity framework for Web services. He is proficient in C/C++, specializing in Web services, information retrieval systems, and enterprise search platforms, focusing primarily on indexing components.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "lakmal@wso2.com",
            firstname: "Lakmal",
            lastname: "Warusawithana",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Lakmal.png",
            title: "Software Architect",
            organisation: "WSO2",
            bio: "<p>Lakmal works with the Cloud Technology team, focusing on the WSO2 Stratos platform as a service.</p> <p>He has more than 11 years of industry experience. In 2005, Lakmal co-founded thinkCube, the pioneers in developing the next generation of collaborative cloud computing products that are tailored towards telecom operators. He oversaw the overall engineering process and focused special attention to scalability and service delivery of thinkCube solutions.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "miyuru@wso2.com",
            firstname: "Miyuru",
            lastname: "Wanninayaka",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Miyuru.png",
            title: "Technical Lead",
            organisation: "WSO2",
            bio: "<p>Miyuru, who is also a member of the Integration Technologies Management Committee, focuses on the WSO2 Enterprise Service Bus (ESB). In addition to his product development efforts, he has provided technology consulting on customer engagements, helping to successfully implement enterprise integration and mobile services gateway solutions.</p> <p>He is a Sun-certified Java programmer and committer for the Apache Synapse open source ESB project. As a participant in the Google Summer of Code for 2008, he developed a data mining and visualization library for Sahana, an open source disaster management system.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "nuwan@wso2.com",
            firstname: "Nuwan",
            lastname: "Bandara",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Nuwan.png",
            title: "Technical Lead",
            organisation: "WSO2",
            bio: "<p>Nuwan is also a product manager, focusing on the WSO2 User Engagement Server, WSO2 Enterprise Store, and Jaggeryjs. Additionally, he has provided technology consulting on customer engagements, including identity solutions and systems integration for the telecommunications, banking and financial services industries.</p> <p>He specializes in Java enterprise technologies, service-oriented architecture implementation, distributed computing, Web engineering with JavaScript/Java/PHP technologies and software design patterns. He has contributed to the Apache Web Services and Shindig projects. In 2007 and 2008, Nuwan was involved in research and development for the European Union’s Information Society Technologies SOA and mobile computing projects. He is also a member of the British Computer Society.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "paul@wso2.com",
            firstname: "Paul",
            lastname: "Fremantle",
	   	 	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Paul.png",
            title: "Co-founder & CTO",
            organisation: "WSO2",
            bio: "<p>Paul co-founded WSO2 in 2005 in order to reinvent the way enterprise middleware is developed, sold, delivered and supported through an open source model. In his current role as CTO, he spearheads WSO2’s overall product strategy. Previously, he served as WSO2 vice president of technical sales where he led the development of the groundbreaking WSO2 Enterprise Service Bus. In 2008, Paul was recognized by InfoWorld among the Top 25 CTOs.</p> <p>Prior to WSO2, Paul was a senior technical staff member at IBM for nine years, where he created the Web Services Gateway and led the team that developed and shipped it as part of the WebSphere Application Server. He also was on the team that put the Service Integration Bus technology into WebSphere Application Server 6. Additionally, Paul was the key WebSphere technical sales lead for Europe, working closely with development to manage beta programs, develop training materials, and enable first-of-a-kind J2EE projects. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "paul.tjapkes@spectrumhealth.org",
            firstname: "Paul",
            lastname: "Tjapkes",
	    	image: "",
            title: "Web/SOA Architect",
            organisation: "Spectrum Health",
            bio: "<p>Paul Tjapkes is the SOA architect for Spectrum Health, an integrated healthcare delivery system based in Michigan. He is a 24-year IT industry veteran and open source advocate who believes in leadership by example.</p><p>Solving business problems with technology has always been his passion whether it is through writing code, designing systems, choosing the right tools, leading projects or leading people.</p> <p>His interest in SOA grew out of a need to provide a consistent view of data on the Web.  Since taking the role as SOA architect, he has focused on creating a sustainable governance program and a stable and scalable infrastructure for hosting web services.</p> <p>He holds a CS degree from Calvin College.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "prabath@wso2.com",
            firstname: "Prabath",
            lastname: "Siriwardena",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Prabath.png",
            title: "Director, Security",
            organisation: "WSO2",
            bio: "<p>Prabath, who is also the chair of the Integration Technologies Management Committee, focuses on application security and identity management. In addition to his product development efforts, he has provided technology consulting on customer engagements, working on the integration of OpenID support.</p><p>He is an Apache Project Management Committee member involved in the Apache Rampart and Axis projects. He also has more than three years of industry experience in Microsoft .NET technologies. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "Prakash_Iyer@trimble.com",
            firstname: "Prakash",
            lastname: "Iyer",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/prakash.png",
            title: "Vice President, Software Architecture & Strategy",
            organisation: "Trimble",
            bio: "<p>Prakash is responsible for initiatives that are critical to Trimble’s software strategy, providing leadership to software-focused development activities. He is a software technologist with over 20 years of engineering and management experience. Prior to joining Trimble in 2007 through the acquisition of the then leader in Mobile Resource Management solutions, @Road Inc., Prakash co-founded Everypath, which pioneered the concept of Enterprise Mobile Task Automation in the early days of mobile computing. At Everypath, he managed distributed development teams in North America, Asia and Europe, managed professional services, and worked with the sales & marketing team to evangelize the company’s products. He has also contributed to successful companies like Prism Solutions, Informix, Hewlett-Packard, Texas Instruments, and Alltel Information Services in various engineering and management roles.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "papatel@west.com",
            firstname: "Pranav",
            lastname: "Patel",
	    	image: "",
            title: "Vice President, Systems Development",
            organisation: "West Interactive",
            bio: "<p>Pranav leads the product engineering efforts of several products including West Connect, Customer Experience Portal and speech application development tool sets within West Interactive. He has been working with technologies as they emerge for more than 20 years, starting with PC-based phone systems to complex self-service solutions and integration. He holds a master's degree in Computer Science.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "rajesh.kaveti@bnymellon.com",
            firstname: "Rajesh",
            lastname: "Kaveti",
	    	image: "",
            title: "Managing Director",
            organisation: "BNYMellon",
            bio: "<p>Rajesh is the divisional chief architect for eCommerce with BNY Mellon. He has been actively involved in various strategic projects within BNY Mellon. At present, he is actively involved with service-oriented architecture strategy and as part of that, has been involved in developing business application monitoring for runtime governance of services.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "sameera@wso2.com",
            firstname: "Sameera",
            lastname: "Jayasoma",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Sameera.png",
            title: "Software Architect",
            organisation: "WSO2",
            bio: "<p>Sameera, who is also a member of the Platform Technologies Management Committee, focusing on the WSO2 Carbon and WSO2 Web Services Application Server. As a WSO2 intern in 2007, Sameera developed an Axiom version of Rhino’s E4X implementation, which is used in the WSO2 Mashup Server. He has also provided technology consulting on customer engagements, including Quick Start Program, Business Process Execution Language (BPEL), and cloud projects.</p><p>He has contributed to a number of Apache Software Foundation (ASF) projects, including Apache Axis2 and Axiom, and was also a co-developer of Apache Rampart2. During the 2007 Google Summer of Code, he contributed to the development of JAX-WS templates for the Apache Axis2/Java Codegen tool. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "samisa@wso2.com",
            firstname: "Samisa",
            lastname: "Abeysinghe",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/samisa3.gif",
            title: "VP, Engineering",
            organisation: "WSO2",
            bio: "<p>Samisa has more than a decade of experience working for systems integrators and software vendors with global exposure. In his current role, he leads the development of WSO2’s three open source platforms: the WSO2 Carbon enterprise middleware platform, WSO2 Stratos cloud middleware platform, and WSO2 StratosLive PaaS.</p> <p>He has been a committer of the Apache Web services project since May 2004, and he initiated the Apache Axis2/C project. He has published two books: RESTFul PHP Web Services, and PHP Team Development, in addition to several articles. He has also spoken at numerous industry conferences, including ApacheCon, ZendCon and IndicThreads, among others. In addition, he is a visiting lecturer at the Computer Science and Engineering Department, University of Moratuwa, Sri Lanka.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "sanjiva@wso2.com",
            firstname: "Sanjiva",
            lastname: "Weerawarana Ph. D",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Sanjiva.png",
            title: "Founder, Chairman & CEO",
            organisation: "WSO2",
            bio: "<p>Sanjiva has been involved with open source for many years and is an active member of the Apache Software Foundation. He was the original creator of Apache SOAP and has been part of Apache Axis, Apache Axis2 and most Apache Web services projects. He founded WSO2 after having spent nearly 8 years in IBM Research, where he was one of the founders of the Web services platform. During that time, he co-authored many Web services specifications including WSDL, BPEL4WS, WS-Addressing, WS-RF and WS-Eventing. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "smalladi@stubhub.com",
            firstname: "Sastry",
            lastname: "Malladi",
	    	image: "",
            title: "Chief Architect",
            organisation: "Stubhub",
            bio: "<p></p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "shankar@wso2.com",
            firstname: "Selvaratnam",
            lastname: "Uthaiyashankar",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Shanker.png",
            title: "Director, Cloud Solutions",
            organisation: "WSO2",
            bio: "<p>Shankar, who is also the chair of the Cloud Technologies Management Committee, focuses on the WSO2 Stratos cloud middleware platform and Carbon enterprise middleware kernel, and has worked on the interoperability of Axis2/C and the WSO2 Web Services Framework. Additionally, he has provided technology consulting on customer engagements, including cloud, enterprise service bus, governance, and mobile integration solutions.</p><p>He is an Apache Software Foundation member and committer on the Axis2/C, Axis2, Rampart/C, and Rampart projects. With more than 4 years of industry experience, he has a strong background in telecommunication software development and after-sale support. He is proficient in C++, Oracle and COM+ technologies. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "senaka@wso2.com",
            firstname: "Senaka",
            lastname: "Fernando",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Senaka.png",
            title: "Senior Technical Lead",
            organisation: "WSO2",
            bio: "<p>Senaka, who is also a member of the Integration Technologies Management Committee, focuses on the WSO2 Governance Registry and WSO2 Cloud Services Gateway. In addition to his product development efforts, he has provided technology consulting on customer engagements, helping to successfully implement governance, enterprise application integration, SAP integration, and on-premise portal solutions. He also founded the WSO2 Web Services Framework/C++ during his internship with WSO2 in 2008.</p><p>He is an elected member of the Apache Software Foundation (ASF) and also a Project Management Committee (PMC) member and committer for a number of projects, which currently include Apache Web Services, Axis2, and several Apache incubator projects. He is also a member of the OASIS S-RAMP, WEMI, and TOSCA technical committees. As a participant of the Google Summer of Code for both 2008 and 2009, he worked on the Apache Harmony and Ptolemy II projects at the University of California, Berkeley. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "shan@wso2.com",
            firstname: "Sinnathamby",
            lastname: "Shanmugarajah",
	   	 	image: "",
            title: "Director, Architecture",
            organisation: "WSO2 Mobile",
            bio: "<p>Shan specializes in mobile technology with over 10 years of experience in that field. He has a strong background in telecommunication software development and is a hardcore coder in Android and iOS platforms. He also lectures in advanced Android and iOS application development.</p><p>Prior to joining WSO2Mobile, he was working as the CTO/Director of Microimage Mobile Media for almost 15 years. He played a key role in engineering products where Microimage has won many local and international awards. He is also a Typographist and a specialist in local languages and font technologies. He worked as an external consultant to Microsoft, Sri Lanka and ICTA, Sri Lanka.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "srinath@wso2.com",
            firstname: "Srinath",
            lastname: "Perera, Ph.D",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Srinath.png",
            title: "Director, Research",
            organisation: "WSO2",
            bio: "<p>Srinath oversees the overall WSO2 platform architecture alongside WSO2 CTO Paul Fremantle. He specializes in Web services and distributed systems, specifically working with aspects of data, scale, and performance.</p><p>He is a co-founder of Apache Axis2, an elected member of the Apache Software Foundation, and a Project Management Committee member. He has been involved with the Apache Web Services project since 2002, and is a committer on several Apache open-source projects, including Apache Axis, Axis2, and Geronimo. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "suho@wso2.com",
            firstname: "Sriskandarajah",
            lastname: "Suhothayan",
	        image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/suho.gif",
            title: "Associate Technical Lead",
            organisation: "WSO2",
            bio: "<p>Suho is an open source enthusiast, and has successfully completed two Google Summer of Code programs in 2010 and 2011. For GSOC 2010, he integrated OpenID Authentication and implemented Role Based Access Control for Apache PhotArk. Whilst for GSOC 2011, he implemented OpenMRS Notifiable Condition Detection (NCD) Module, a real time system that monitors patients' lab results and notifies critical cases. He is now a committer on both Apache PhotArk and OpenMRS projects. He holds a Bachelor of Science in Engineering from University of Moratuwa, Sri Lanka where he specialized in Computer Science and Engineering. As project lead of his final year project, Suho drove the design and implementation of Siddhi-CEP - a High Performance Complex Event Processing Engine.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "sumedha@wso2.com",
            firstname: "Sumedha",
            lastname: "Rubasinghe",
	    	image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/Sumedha.png",
            title: "Senior Software Architect",
            organisation: "WSO2",
            bio: "<p>Sumedha, who is also the chair of the Data Technologies Management Committee, focuses on development of the WSO2 Carbon Core, WSO2 Data Services, WSO2 Governance Registry, WSO2 Business Activity Monitor, and WSO2 API Manager. He has contributed to the successful implementation of data, SAP and repository-based integration projects, as well many WSO2 QuickStart development consulting engagements. He is an active committer with the Apache Axis2 project. </p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "thomas.wieger@t-systems.com",
            firstname: "Thomas",
            lastname: "Wieger",
	        image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/thomas.png",
            title: "Solutions Architect",
            organisation: "T-Systems International GmbH",
            bio: "<p>Thomas’s passion is to develop and architect software systems since he took his first steps with a ZX81 home computer at the age of 14. He joined T-Systems in 2004 as a Software Architect working on different systems of medium and large size. Since 2011, he has been involved in the development of the connected car platform architecture.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },        {
            id: "frego@novell.com",
            firstname: "Frank",
            lastname: "Rego",
	        image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/rego.jpg",
            title: "Business Development Manager",
            organisation: "SUSE",
            bio: "<p>Frank Rego is Business Development Manager at SUSE, the original provider of the enterprise Linux distribution and the most interoperable platform for mission-critical computing. He has been with SUSE since 1999, and works with technology partners to define and bring to market best of breed solutions for enterprise and cloud computing.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "jim",
            firstname: "Jim",
            lastname: "Crabbe",
	        image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/jim.png",
            title: "Sr. Product Manager",
            organisation: "Boeing",
            bio: "<p>Jim started with the Boeing Company in 2011 leading product strategy and development efforts for MyBoeingFleet.com, the world’s largest and most prolific aviation services portal.  In that role he led the full product lifecycle for products and capabilities involving Identity and Access Management, Business Intelligence, and Portal technologies. </p><p>He currently leads a team of product managers at the Boeing Company to define and deliver a multitenant, cloud enabled Platform as a Service offering designed to power the next generation of aviation software products.</p><p>Prior to his work at the Boeing Company, Jim has actively developed innovative technology solutions and products for over 15 years.  He has experience building solutions for companies ranging in size from his own startups to Fortune 500 enterprises.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "neeraj",
            firstname: "Neeraj",
            lastname: "Satija",
	        image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/neeraj.png",
            title: "Software Developement Manager",
            organisation: "Two Degrees Mobile",
            bio: "",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "tyler",
            firstname: "Tyler",
            lastname: "Jewell",
	        image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/tyler.png",
            title: "CEO & Founder",
            organisation: "Codenvy",
            bio: "<p> Tyler is CEO of Codenvy and a venture partner with Toba Capital where he focuses on developer investments. He sits on the board of Sauce Labs, WSO2, Exo Platform and Codenvy along with making investments in Cloudant, ZeroTurnaround, InfoQ, and AppHarbor.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
        {
            id: "cesar",
            firstname: "Cesar",
            lastname: "William Alvarenga",
	        image: "http://wso2con.com/wp-content/themes/wso2con2013/images-us/speakers/cesar.png",
            title: "Front End Engineer",
            organisation: "Algar Telecom",
            bio: "<p> Cesar William is a Front End Engineer at Algar Telecom. Currently he's working with the innovative platform Coreo which is built on open source software such as WSO2 and Apache Projects.</p>",
            expertise: "",
            registrationcode: "speaker",
            home: "",
            interests: "",
            accepting: 1
        },
    ]
}
